joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
// license:BSD-3-Clause
//
// TMS57002 JIT implementation. See tms57002_jit.h.
#include "tms57002_jit.h"
#include "tms57002_ops.h"   // M2 pooled op-body emitter (op_poolable / emit_op_pooled)

// Host-arch codegen backend. THE HOST HERE IS x86-64 (Intel) — the a64 path is preserved for
// a future Apple Silicon host but does not compile/run here.
#if defined(__aarch64__)
#include <asmjit/a64.h>   // arm64 Compiler + emitter
#define KPROP_JIT_A64 1
#elif defined(__x86_64__)
#include <asmjit/x86.h>    // x86-64 Compiler + emitter
#define KPROP_JIT_X64 1
#endif
#include <cstdio>
#include <cstdlib>
#include <map>
#include <set>

namespace tms57002 {

namespace {
// C-callable wrappers so JIT-compiled code can call the device's per-op trampoline
// and idle check (asmjit invokes these by absolute address).
[[maybe_unused]] void jit_step(tms57002_device *d) { d->jit_step_one(); }                       // one program instruction (AArch64 trampoline)
[[maybe_unused]] unsigned jit_idle(tms57002_device *d) { return d->jit_is_idle() ? 1u : 0u; }   // program hit `idle` (AArch64 trampoline)

// Wrappers the native per-PC JIT calls (free functions -> the public seam methods).
void jit_w_op(tms57002_device *d, unsigned op, const void *i) { d->jit_op_exec(op, i); }
int jit_w_post(tms57002_device *d, int iipc, int ipc) { return d->jit_pc_post(iipc, ipc); }
void jit_w_xm(tms57002_device *d) { d->jit_xm_step(); }
[[maybe_unused]] void jit_w_xm_init(tms57002_device *d) { d->jit_xm_init(); }   // rde/wre arm the XRAM transaction (x86 pooled path only today)
void jit_w_run_rest(tms57002_device *d, int ipc) { d->jit_run_rest(ipc); }   // whole-frame fallback tail
[[maybe_unused]] u32 jit_w_get_cmem(tms57002_device *d, unsigned a) { return d->jit_get_cmem(u8(a)); }   // lacc deopt (x86 pooled path only today)
long s_forced_midframe_fallback_hits = 0;
void jit_w_forced_midframe_fallback_hit() { ++s_forced_midframe_fallback_hits; }
}  // namespace

// Compile: void run(tms57002_device* dev, int steps) — loop calling jit_step(dev)
// until the program idles or `steps` runs out. The interpreter trampoline today;
// native per-op codegen replaces the call site by op in later phases.
Jit::SampleFn Jit::compile_trampoline_loop()
{
#ifdef KPROP_JIT_A64
	using namespace asmjit;

	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	a64::Compiler cc(&code);

	FuncNode *fn = cc.add_func(FuncSignature::build<void, tms57002_device *, int>());
	if (!fn)
		return nullptr;

	a64::Gp dev = cc.new_gpz("dev");
	a64::Gp steps = cc.new_gp32("steps");
	fn->set_arg(0, dev);
	fn->set_arg(1, steps);

	Label loop = cc.new_label();
	Label end = cc.new_label();

	cc.bind(loop);
	cc.cbz(steps, end);   // steps == 0 -> done

	InvokeNode *call_step = nullptr;
	cc.invoke(Out(call_step), uint64_t(&jit_step), FuncSignature::build<void, tms57002_device *>());
	call_step->set_arg(0, dev);

	a64::Gp idle = cc.new_gp32("idle");
	InvokeNode *call_idle = nullptr;
	cc.invoke(Out(call_idle), uint64_t(&jit_idle), FuncSignature::build<unsigned, tms57002_device *>());
	call_idle->set_arg(0, dev);
	call_idle->set_ret(0, idle);

	cc.cbnz(idle, end);   // idle -> done
	cc.sub(steps, steps, 1);
	cc.b(loop);

	cc.bind(end);
	cc.end_func();
	if (cc.finalize() != kErrorOk)
		return nullptr;

	SampleFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk)
		return nullptr;
	return out;
#else
	return nullptr;   // x86-64: trampoline loop not ported (run_sample_compiled falls back to run_sample)
#endif
}

std::array<u32, 4> Jit::run_sample_compiled(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	if (!m_fn)
		m_fn = compile_trampoline_loop();
	if (!m_fn)
		return run_sample(dsp, in, max_steps);   // codegen unavailable -> C++ seam
	dsp.jit_begin_frame(in);
	m_fn(&dsp, max_steps > 0 ? max_steps : 1);
	return dsp.jit_end_frame();
}

std::array<u32, 4> Jit::run_sample(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	dsp.jit_begin_frame(in);
	int guard = max_steps > 0 ? max_steps : 1;
	while (!dsp.jit_is_idle() && guard-- > 0)
		dsp.jit_step_one();
	return dsp.jit_end_frame();
}

#ifdef KPROP_JIT_A64
// Emit the per-PC jit_pc_post via the C++ helper (memory-based). Returns the next-ipc reg.
// compile_frame will replace this with a register-cached inline post; compile_pc keeps it.
static asmjit::a64::Gp emit_post_call(asmjit::a64::Compiler &cc, asmjit::a64::Gp dev, int iipc, asmjit::a64::Gp chain_ipc)
{
	using namespace asmjit;
	a64::Gp ret = cc.new_gp32("ret");
	InvokeNode *p = nullptr;
	cc.invoke(Out(p), uint64_t(&jit_w_post), FuncSignature::build<int, tms57002_device *, int, int>());
	p->set_arg(0, dev);
	p->set_arg(1, Imm(iipc));
	p->set_arg(2, chain_ipc);
	p->set_ret(0, ret);
	return ret;
}

// Emit ONE PC's chain body into an existing compiler (cc): inline jit_pc_pre (idle/MACC/
// xm-skip), the chain UNROLLED at compile time (jit_op_exec per micro-op + S_IDLE early-out
// to chain_end, terminator ++ca/++id native). Returns chain_ipc (the next-ipc) in a register;
// the CALLER emits the post. ok=false on a malformed chain. Reused by compile_pc (one PC = one
// function) and compile_frame (all PCs inlined into one frame fn). No runtime chain-walk/decode.
static asmjit::a64::Gp emit_pc_body(asmjit::a64::Compiler &cc, asmjit::a64::Gp dev, tms57002_device &dsp, int ipc, bool &ok)
{
	using namespace asmjit;

	a64::Gp chain_ipc = cc.new_gp32("chain_ipc");
	Label chain_end = cc.new_label();
	const int off_sti = int(tms57002_device::jit_off_sti());
	const unsigned idle_bit = __builtin_ctz(tms57002_device::jit_s_idle_mask());   // S_IDLE bit position
	const unsigned read_bit = __builtin_ctz(tms57002_device::jit_s_read_mask());
	const unsigned write_bit = __builtin_ctz(tms57002_device::jit_s_write_mask());
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	const int off_ca = int(tms57002_device::jit_off_ca());
	const int off_id = int(tms57002_device::jit_off_id());

