joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	// Inline jit_pc_pre: rare xm_step (skipped unless S_READ|S_WRITE) + native MACC pipeline.
	{
		a64::Gp sti = cc.new_gp32("sti");
		cc.ldr(sti, a64::ptr(dev, off_sti));
		Label call_xm = cc.new_label();
		Label after_xm = cc.new_label();
		cc.tbnz(sti, Imm(read_bit), call_xm);
		cc.tbnz(sti, Imm(write_bit), call_xm);
		cc.b(after_xm);
		cc.bind(call_xm);
		{
			InvokeNode *x = nullptr;
			cc.invoke(Out(x), uint64_t(&jit_w_xm), FuncSignature::build<void, tms57002_device *>());
			x->set_arg(0, dev);
		}
		cc.bind(after_xm);
		// macc_read = macc_write; macc_write = macc;   (s64, native 64-bit ldr/str)
		a64::Gp t = cc.new_gpz("t");
		cc.ldr(t, a64::ptr(dev, off_macc_w));
		cc.str(t, a64::ptr(dev, off_macc_r));
		cc.ldr(t, a64::ptr(dev, off_macc));
		cc.str(t, a64::ptr(dev, off_macc_w));
	}

	int cur = ipc;
	for (int steps = 0; ; ++steps)
	{
		if (steps > 64) { ok = false; return chain_ipc; }   // malformed chain (no terminator)
		const unsigned op = dsp.jit_inst_op(cur);
		const int next = dsp.jit_inst_next(cur);
		const uint64_t icd_addr = dsp.jit_inst_addr(cur);
		cc.mov(chain_ipc, Imm(next));   // ipc after this op (used if we break here)

		if (op < 4)
		{
			// chain terminator, inlined native: op0 nop, op1 ++ca, op2 ++id, op3 both (u8 wrap).
			if (op == 1 || op == 3)
			{
				a64::Gp r = cc.new_gp32("ca");
				cc.ldrb(r, a64::ptr(dev, off_ca));
				cc.add(r, r, Imm(1));
				cc.strb(r, a64::ptr(dev, off_ca));
			}
			if (op == 2 || op == 3)
			{
				a64::Gp r = cc.new_gp32("id");
				cc.ldrb(r, a64::ptr(dev, off_id));
				cc.add(r, r, Imm(1));
				cc.strb(r, a64::ptr(dev, off_id));
			}
			break;
		}

		{
			InvokeNode *m = nullptr;
			cc.invoke(Out(m), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>());
			m->set_arg(0, dev);
			m->set_arg(1, Imm(op));
			m->set_arg(2, Imm(icd_addr));
		}
		{
			// S_IDLE early-out, native (no helper call): if (sti & S_IDLE) goto chain_end.
			a64::Gp sti = cc.new_gp32("sti");
			cc.ldr(sti, a64::ptr(dev, off_sti));
			cc.tbnz(sti, Imm(idle_bit), chain_end);
		}
		cur = next;
	}

	cc.bind(chain_end);
	ok = true;
	return chain_ipc;   // the post is emitted by the caller (memory-based, or register-cached in compile_frame)
}

// Compile one PC's chain to int fn(device) returning the next ipc — emit_pc_body + ret.
Jit::PcFn Jit::compile_pc(tms57002_device &dsp, int ipc)
{
	using namespace asmjit;

	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	a64::Compiler cc(&code);
	FuncNode *fn = cc.add_func(FuncSignature::build<int, tms57002_device *>());
	if (!fn)
		return nullptr;

	a64::Gp dev = cc.new_gpz("dev");
	fn->set_arg(0, dev);

	bool ok = true;
	a64::Gp chain_ipc = emit_pc_body(cc, dev, dsp, ipc, ok);
	if (!ok)
		return nullptr;
	a64::Gp ret = emit_post_call(cc, dev, ipc, chain_ipc);   // iipc == chain head
	cc.ret(ret);
	cc.end_func();
	if (cc.finalize() != kErrorOk)
		return nullptr;

	PcFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk)
		return nullptr;
	return out;
}
#elif defined(KPROP_JIT_X64)
// x86-64 port of the per-PC emitters (mirrors the a64 logic; memory-based machinery + helper calls
// for now — register-residency + op inlining come next, as proven by compile_frame_callfree's 24x).
static asmjit::x86::Gp emit_post_call(asmjit::x86::Compiler &cc, asmjit::x86::Gp dev, int iipc, asmjit::x86::Gp chain_ipc)
{
	using namespace asmjit;
	x86::Gp ret = cc.new_gp32("ret");
	InvokeNode *p = nullptr;
	cc.invoke(Out(p), uint64_t(&jit_w_post), FuncSignature::build<int, tms57002_device *, int, int>());
	p->set_arg(0, dev);
	p->set_arg(1, Imm(iipc));
	p->set_arg(2, chain_ipc);
	p->set_ret(0, ret);
	return ret;
}

static asmjit::x86::Gp emit_pc_body(asmjit::x86::Compiler &cc, asmjit::x86::Gp dev, tms57002_device &dsp, int ipc, bool &ok,
	asmjit::x86::Gp r_macc, asmjit::x86::Gp r_macc_r, asmjit::x86::Gp r_macc_w)
{
	using namespace asmjit;
	x86::Gp chain_ipc = cc.new_gp32("chain_ipc");
	Label chain_end = cc.new_label();
	const int off_sti = int(tms57002_device::jit_off_sti());
	const u32 idle_mask = tms57002_device::jit_s_idle_mask();
	const u32 rw_mask = tms57002_device::jit_s_read_mask() | tms57002_device::jit_s_write_mask();
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	const int off_ca = int(tms57002_device::jit_off_ca());
	const int off_id = int(tms57002_device::jit_off_id());

	// macc/macc_read/macc_write are register-cached across the frame; sync to/from device memory
	// only around calls that may touch them (jit_w_xm, jit_w_op). Inlined ops (lacc/lira) don't.
	auto macc_out = [&]() { cc.mov(x86::qword_ptr(dev, off_macc), r_macc); cc.mov(x86::qword_ptr(dev, off_macc_r), r_macc_r); cc.mov(x86::qword_ptr(dev, off_macc_w), r_macc_w); };
	auto macc_in = [&]() { cc.mov(r_macc, x86::qword_ptr(dev, off_macc)); cc.mov(r_macc_r, x86::qword_ptr(dev, off_macc_r)); cc.mov(r_macc_w, x86::qword_ptr(dev, off_macc_w)); };

	// %wa(rr): aacc = saturate(s64 rr) — if out of int32 range set ST1_AOV, and if ST1_AOVM clamp
	// to [-2^31, 2^31-1]; then aacc = (u32)rr. Shared by add/sub/neg (the tmsinstr.lst %wa macro).
	const int off_aacc_wa = int(tms57002_device::jit_off_aacc());
	const int off_st1_wa = int(tms57002_device::jit_off_st1());
	auto emit_wa = [&](x86::Gp rr) {
		x86::Gp chk = cc.new_gpz();
		cc.movsxd(chk, rr.r32()); cc.cmp(chk, rr);
		Label no_ovf = cc.new_label();
		cc.je(no_ovf);
		cc.or_(x86::dword_ptr(dev, off_st1_wa), Imm(tms57002_device::jit_st1_aov()));
		Label no_clamp = cc.new_label();
		cc.test(x86::dword_ptr(dev, off_st1_wa), Imm(tms57002_device::jit_st1_aovm()));
		cc.jz(no_clamp);
		x86::Gp hi = cc.new_gpz(), lo = cc.new_gpz();
		cc.mov(hi, Imm(2147483647LL)); cc.cmp(rr, hi); cc.cmovg(rr, hi);
		cc.mov(lo, Imm(-2147483648LL)); cc.cmp(rr, lo); cc.cmovl(rr, lo);
		cc.bind(no_clamp);
		cc.bind(no_ovf);
		cc.mov(x86::dword_ptr(dev, off_aacc_wa), rr.r32());
	};
	(void)emit_wa;

	// Inline jit_pc_pre: rare xm_step (skipped unless S_READ|S_WRITE) + MACC pipeline (registers).
	{
		x86::Gp sti = cc.new_gp32("sti");
		cc.mov(sti, x86::dword_ptr(dev, off_sti));
		Label call_xm = cc.new_label(), after_xm = cc.new_label();
		cc.test(sti, Imm(rw_mask));
		cc.jnz(call_xm);
		cc.jmp(after_xm);
		cc.bind(call_xm);
		macc_out();
		{
			InvokeNode *x = nullptr;
			cc.invoke(Out(x), uint64_t(&jit_w_xm), FuncSignature::build<void, tms57002_device *>());
			x->set_arg(0, dev);
		}
		macc_in();
		cc.bind(after_xm);
		cc.mov(r_macc_r, r_macc_w);   // macc_read = macc_write; macc_write = macc;  (registers)
		cc.mov(r_macc_w, r_macc);
	}

