joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	int cur = ipc;
	for (int steps = 0; ; ++steps)
	{
		if (steps > 64) { ok = false; return chain_ipc; }
		const unsigned op = dsp.jit_inst_op(cur);
		if (op >= 4 && !dsp.jit_op_mnemonic(op)) { ok = false; return chain_ipc; }   // out-of-range op (a
			// stale/churned decode-cache entry in the live machine) -> bail; the caller runs this frame via
			// the interpreter instead of baking a deopt that would hand jit_op_exec a fatal opcode.
		const int next = dsp.jit_inst_next(cur);
		const uint64_t icd_addr = dsp.jit_inst_addr(cur);
		cc.mov(chain_ipc, Imm(next));
		if (op < 4)
		{
			if (op == 1 || op == 3) { x86::Gp r = cc.new_gp32(); cc.movzx(r, x86::byte_ptr(dev, off_ca)); cc.add(r, Imm(1)); cc.mov(x86::byte_ptr(dev, off_ca), r.r8()); }
			if (op == 2 || op == 3) { x86::Gp r = cc.new_gp32(); cc.movzx(r, x86::byte_ptr(dev, off_id)); cc.add(r, Imm(1)); cc.mov(x86::byte_ptr(dev, off_id), r.r8()); }
			break;
		}
		const char *mn = dsp.jit_op_mnemonic(op);
		if (mn && __builtin_strcmp(mn, "lira") == 0)
		{
			// lira: id = aacc >> 24 — native, no call. Doesn't touch sti, so no idle check needed.
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			x86::Gp a = cc.new_gp32();
			cc.mov(a, x86::dword_ptr(dev, off_aacc));
			cc.shr(a, Imm(24));
			cc.mov(x86::byte_ptr(dev, off_id), a.r8());
		}
		else if (mn && __builtin_strcmp(mn, "lcak") == 0)
		{
			// lcak: ca = i->param (immediate). Native, no call; doesn't touch sti.
			cc.mov(x86::byte_ptr(dev, off_ca), Imm(u8(dsp.jit_inst_param(cur))));
		}
		else if (mn && __builtin_strcmp(mn, "lirk") == 0)
		{
			// lirk: id = i->param (immediate). Native, no call; doesn't touch sti.
			cc.mov(x86::byte_ptr(dev, off_id), Imm(u8(dsp.jit_inst_param(cur))));
		}
		else if (mn && __builtin_strcmp(mn, "lacc") == 0 && dsp.jit_op_variant(op) == 0)
		{
			// lacc: aacc = get_cmem(param). FAST PATH aacc = cmem[param] when no cmem update is
			// pending and no debug force; DEOPT to jit_w_get_cmem otherwise. Doesn't set S_IDLE.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			{ x86::Gp v = cc.new_gp32(); cc.mov(v, x86::dword_ptr(dev, off_cmem + int(param) * 4)); cc.mov(x86::dword_ptr(dev, off_aacc), v); }
			cc.jmp(doneop);
			cc.bind(deopt);
			{
				InvokeNode *g = nullptr;
				cc.invoke(Out(g), uint64_t(&jit_w_get_cmem), FuncSignature::build<u32, tms57002_device *, unsigned>());
				g->set_arg(0, dev);
				g->set_arg(1, Imm(param));
				x86::Gp v = cc.new_gp32();
				g->set_ret(0, v);
				cc.mov(x86::dword_ptr(dev, off_aacc), v);
			}
			cc.bind(doneop);
		}
		else if (mn && __builtin_strcmp(mn, "smhd") == 0 && !dsp.jit_smhd_raw_path()
			&& (dsp.jit_op_variant(op) == 0 || dsp.jit_op_variant(op) == 80))
		{
			// smhd sfmo=0 dmode=0 dbp=0 rnd=0: dmem0[(param+ba0)&0xff] = (macc_read >> 24) & 0xffffff (the
			// common, no-overflow case of macc_to_output_0[s]). variant 0 (movm=0): overflow just sets
			// ST1_MOV (native). variant 80 (movm=1): overflow ALSO clamps macc, which we DEOPT to the
			// interpreter (rare — normal audio doesn't overflow this, so the common path stays native and
			// the clamp stays oracle-correct rather than un-exercised JIT code). Reads register-cached
			// r_macc_r; writes dmem0; no cmem read / macc write / S_IDLE. Variant indices 0/80 pin
			// sfmo=dmode=dbp=rnd=0; sfmo>0 (v84/v88) and other variants deopt via the generic else.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool movm = dsp.jit_op_variant(op) == 80;   // v80 = movm=1 -> overflow clamps -> deopt it
			const int off_st1 = int(tms57002_device::jit_off_st1());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const u32 st1_mov = tms57002_device::jit_st1_mov();
			Label smhd_done = cc.new_label();
			{   // overflow: m1 = macc_read & 0xf800000000000; over if (m1 != 0 && m1 != mask)
				Label no_ovf = cc.new_label();
				x86::Gp m1 = cc.new_gpz(), mask = cc.new_gpz();
				cc.mov(mask, Imm(0xf800000000000ULL));
				cc.mov(m1, r_macc_r);
				cc.and_(m1, mask);
				cc.jz(no_ovf);
				cc.cmp(m1, mask);
				cc.je(no_ovf);
				if (movm) {   // v80 overflow needs the macc clamp -> let the interpreter run the whole op
					macc_out();
					InvokeNode *dn = nullptr;
					cc.invoke(Out(dn), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>());
					dn->set_arg(0, dev);
					dn->set_arg(1, Imm(op));
					dn->set_arg(2, Imm(icd_addr));
					macc_in();
					cc.jmp(smhd_done);
				} else {
					cc.or_(x86::dword_ptr(dev, off_st1), Imm(st1_mov));   // v0 overflow -> ST1_MOV (native)
				}
				cc.bind(no_ovf);
			}
			x86::Gp out = cc.new_gpz();                           // out = (macc_read >> 24) & 0xffffff
			cc.mov(out, r_macc_r);
			cc.sar(out, Imm(24));
			cc.and_(out, Imm(0xffffff));
			x86::Gp addr = cc.new_gpz();                          // dmem0[(param + ba0) & 0xff] = out
			cc.movzx(addr, x86::byte_ptr(dev, off_ba0));
			cc.add(addr, Imm(param));
			cc.and_(addr, Imm(0xff));
			cc.mov(x86::dword_ptr(dev, addr, 2, off_dmem0), out.r32());
			cc.bind(smhd_done);
		}
		else if (mn && __builtin_strcmp(mn, "sacd") == 0 && dsp.jit_op_variant(op) == 0)
		{
			// sacd: dmem0[(param+ba0)&0xff] = (aacc >> 8) & 0xffffff. No cmem, no macc, no flags,
			// no S_IDLE -> native inline (write_dmem dmem0 path is a plain masked store).
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			x86::Gp out = cc.new_gp32();
			cc.mov(out, x86::dword_ptr(dev, off_aacc));
			cc.shr(out, Imm(8));
			cc.and_(out, Imm(0xffffff));
			x86::Gp addr = cc.new_gpz();
			cc.movzx(addr, x86::byte_ptr(dev, off_ba0));
			cc.add(addr, Imm(param));
			cc.and_(addr, Imm(0xff));
			cc.mov(x86::dword_ptr(dev, addr, 2, off_dmem0), out);
		}
		else if (mn && __builtin_strcmp(mn, "srbd") == 0 && dsp.jit_op_variant(op) == 0)
		{
			// srbd (dmode=0): dmem0[(param+ba0)&0xff] = xrd & 0xffffff. No cmem/macc/S_IDLE.
			// NOTE: srbd has dmode/dbp variants; if DSP1 uses a non-dmem0 one this MISMATCHes
			// (the gate catches it) -> revert. Mirrors the smhd/sacd simple-store pattern.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_xrd = int(tms57002_device::jit_off_xrd());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			x86::Gp out = cc.new_gp32();
			cc.mov(out, x86::dword_ptr(dev, off_xrd));
			cc.and_(out, Imm(0xffffff));
			x86::Gp addr = cc.new_gpz();
			cc.movzx(addr, x86::byte_ptr(dev, off_ba0));
			cc.add(addr, Imm(param));
			cc.and_(addr, Imm(0xff));
			cc.mov(x86::dword_ptr(dev, addr, 2, off_dmem0), out);
		}
		else if (mn && __builtin_strcmp(mn, "lacd") == 0 && dsp.jit_op_variant(op) == 0)
		{
			// lacd v0 (dmode=0 sfai=0 dbp=0): aacc = dmem0[(param+ba0)&0xff] << 8. No cmem/macc -> native,
			// validatable (writes aacc). Non-0 variants (sfai/dmode/dbp) deopt via the generic else.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			x86::Gp addr = cc.new_gpz();
			cc.movzx(addr, x86::byte_ptr(dev, off_ba0));
			cc.add(addr, Imm(param));
			cc.and_(addr, Imm(0xff));
			x86::Gp d = cc.new_gp32();
			cc.mov(d, x86::dword_ptr(dev, addr, 2, off_dmem0));   // dmem0[(param+ba0)&0xff]
			cc.shl(d, Imm(8));                                    // << 8
			cc.mov(x86::dword_ptr(dev, off_aacc), d);             // aacc = d
		}
		else if ((op == 954 || op == 938) && !dsp.jit_mpy_forward_on())
		{
			// mac (954) / mpy (938), cmode=1 dmode=0 dbp=0 sfma=0 — the hot cmem-read multiply-
			// accumulate, REGISTER-RESIDENT (operates on r_macc directly; no macc spill/call — the
			// residency lever 1(a) validated). Normal contract:
			//   d = sext24(dmem0[(param+ba0)&0xff]);  c = cmem[ca] (fast; DEOPT if update pending);
			//   creg = c;  r = (int64_t)(int32_t)c * (int64_t)(int32_t)d;  product = r >> 7;
			//   mac: macc += product;   mpy: macc = product.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool is_mac = (op == 954);
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const int off_ca = int(tms57002_device::jit_off_ca());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_creg = int(tms57002_device::jit_off_creg());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp addr = cc.new_gpz();
			cc.movzx(addr, x86::byte_ptr(dev, off_ba0)); cc.add(addr, Imm(param)); cc.and_(addr, Imm(0xff));
			x86::Gp d2 = cc.new_gp32();
			cc.mov(d2, x86::dword_ptr(dev, addr, 2, off_dmem0));   // dmem0[addr]
			cc.shl(d2, Imm(8)); cc.sar(d2, Imm(8));                // sign-extend bit23 -> 32
			x86::Gp cai = cc.new_gpz();
			cc.movzx(cai, x86::byte_ptr(dev, off_ca));
			x86::Gp c = cc.new_gp32();
			cc.mov(c, x86::dword_ptr(dev, cai, 2, off_cmem));      // c = cmem[ca]
			cc.mov(x86::dword_ptr(dev, off_creg), c);             // creg = c
			x86::Gp rc = cc.new_gpz(), rd = cc.new_gpz();
			cc.movsxd(rc, c); cc.movsxd(rd, d2);
			cc.imul(rc, rd);                                      // r = (int64)c * (int64)d
			cc.sar(rc, Imm(7));                                   // product = r >> 7
			if (is_mac) cc.add(r_macc, rc); else cc.mov(r_macc, rc);   // macc += / = product (REGISTER)
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{
				InvokeNode *mm = nullptr;
				cc.invoke(Out(mm), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>());
				mm->set_arg(0, dev); mm->set_arg(1, Imm(op)); mm->set_arg(2, Imm(icd_addr));
			}
			macc_in();
			cc.bind(doneop);
			// mac/mpy don't set S_IDLE -> no idle check.
		}
		else if (op == 1121)
		{
			cc.xor_(r_macc, r_macc);   // zmac: macc = 0
		}
		else if (op == 985 || op == 949)
		{
			// mac 985 (c=aacc, macc +=, creg=aacc) / mpy 949 (c=creg, macc =), d=sext(dmem[param+ba0]),
			// dc shift (r>>7). No cmem read -> no deopt.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool is_mac = (op == 985);
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_creg = int(tms57002_device::jit_off_creg());
			x86::Gp addr = cc.new_gpz(); cc.movzx(addr, x86::byte_ptr(dev, off_ba0)); cc.add(addr, Imm(param)); cc.and_(addr, Imm(0xff));
			x86::Gp d = cc.new_gp32(); cc.mov(d, x86::dword_ptr(dev, addr, 2, off_dmem0)); cc.shl(d, Imm(8)); cc.sar(d, Imm(8));
			x86::Gp rc = cc.new_gpz(), rd = cc.new_gpz();
			if (is_mac) {
				// mac a,%d routes %a to the multiplier's full-width C input. The 24-bit
				// truncation applies only when %a is the second operand (the c,a forms).
				x86::Gp t = cc.new_gp32(); cc.mov(t, x86::dword_ptr(dev, off_aacc));
				cc.mov(x86::dword_ptr(dev, off_creg), t);
				cc.movsxd(rc, t);
			} else {
				cc.movsxd(rc, x86::dword_ptr(dev, off_creg));   // c = creg
			}
			cc.movsxd(rd, d);
			cc.imul(rc, rd); cc.sar(rc, Imm(7));
			if (is_mac) cc.add(r_macc, rc); else cc.mov(r_macc, rc);
		}
		else if (op == 1018 || op == 945 || op == 946)
		{
			// mac 1018 (c=cmem[ca],+=) / mpy 945 (c=cmem[param],=) / mpy 946 (c=cmem[ca],=),
			// d=aacc, ca shift (r>>15). creg = c. Fast cmem; DEOPT if pending.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool is_mac = (op == 1018);
			const bool by_ca = (op == 1018 || op == 946);
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_ca = int(tms57002_device::jit_off_ca());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_creg = int(tms57002_device::jit_off_creg());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp c = cc.new_gp32();
			if (by_ca) { x86::Gp cai = cc.new_gpz(); cc.movzx(cai, x86::byte_ptr(dev, off_ca)); cc.mov(c, x86::dword_ptr(dev, cai, 2, off_cmem)); }
			else       cc.mov(c, x86::dword_ptr(dev, off_cmem + int(param) * 4));
			cc.mov(x86::dword_ptr(dev, off_creg), c);
			x86::Gp rc = cc.new_gpz(), rd = cc.new_gpz();
			cc.movsxd(rc, c);
			x86::Gp av = cc.new_gp32(); cc.mov(av, x86::dword_ptr(dev, off_aacc));
			cc.and_(av, Imm(0xffffff00U));                  // d = 24-bit multiplier A-port view of aacc
			cc.movsxd(rd, av);
			cc.imul(rc, rd); cc.sar(rc, Imm(15));
			if (is_mac) cc.add(r_macc, rc); else cc.mov(r_macc, rc);
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *mv = nullptr; cc.invoke(Out(mv), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); mv->set_arg(0, dev); mv->set_arg(1, Imm(op)); mv->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(doneop);
		}
		else if (op == 1131 || op == 1130)
		{
			// lmhc: macc = macc_write = ((int64)(int32)get_cmem(ca|param)) << 16. Fast cmem; DEOPT if pending.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool by_ca = (op == 1131);
			const int off_ca = int(tms57002_device::jit_off_ca());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp v = cc.new_gp32();
			if (by_ca) { x86::Gp cai = cc.new_gpz(); cc.movzx(cai, x86::byte_ptr(dev, off_ca)); cc.mov(v, x86::dword_ptr(dev, cai, 2, off_cmem)); }
			else       cc.mov(v, x86::dword_ptr(dev, off_cmem + int(param) * 4));
			cc.movsxd(r_macc, v); cc.shl(r_macc, Imm(16)); cc.mov(r_macc_w, r_macc);
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *ml = nullptr; cc.invoke(Out(ml), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); ml->set_arg(0, dev); ml->set_arg(1, Imm(op)); ml->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(doneop);
		}
		else if ((op == 1122 || op == 1123) && !dsp.jit_lmhd_forward_on())
		{
			// lmhd: macc = macc_write = ((int64)(int32)(dmem0[((param|id)+ba0)&0xff]<<8)) << 16. No cmem.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool by_id = (op == 1123);
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const int off_id = int(tms57002_device::jit_off_id());
			x86::Gp addr = cc.new_gpz(); cc.movzx(addr, x86::byte_ptr(dev, off_ba0));
			if (by_id) { x86::Gp idr = cc.new_gpz(); cc.movzx(idr, x86::byte_ptr(dev, off_id)); cc.add(addr, idr); }
			else       cc.add(addr, Imm(param));
			cc.and_(addr, Imm(0xff));
			x86::Gp v = cc.new_gp32(); cc.mov(v, x86::dword_ptr(dev, addr, 2, off_dmem0)); cc.shl(v, Imm(8));
			cc.movsxd(r_macc, v); cc.shl(r_macc, Imm(16)); cc.mov(r_macc_w, r_macc);
		}
		else if (op == 1843)
		{
			// sfmo (op 1843): st1 = st1 & ~ST1_SFMO (set sfmo mode 0). No macc/aacc/S_IDLE — a pure
			// st1 write. Inlining it stops the generic fallback from spilling macc around a call for a
			// non-macc op (the residency lever: keep macc register-resident across it). 28x/DSP1 frame.
			const int off_st1 = int(tms57002_device::jit_off_st1());
			cc.and_(x86::dword_ptr(dev, off_st1), Imm(~tms57002_device::jit_st1_sfmo()));
		}
		else if (op == 436)
		{
			// sub (op 436, cmode=0 sfao=0): aacc = %wa( (int32)get_cmem(param) - (int32)aacc ).
			// No macc. Tests the %wa write-aacc-with-saturation macro (overflow -> ST1_AOV; AOVM -> clamp).
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_st1 = int(tms57002_device::jit_off_st1());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp rr = cc.new_gpz();
			cc.movsxd(rr, x86::dword_ptr(dev, off_cmem + int(param) * 4));   // rr = (int64)(int32)cmem[param]
			x86::Gp ra = cc.new_gpz();
			cc.movsxd(ra, x86::dword_ptr(dev, off_aacc));                   // ra = (int64)(int32)aacc
			cc.sub(rr, ra);                                                // rr = c - aacc
			// %wa(rr) -> aacc : if (rr out of int32) { st1|=AOV; if(st1&AOVM) clamp }; aacc = (u32)rr
			{
				x86::Gp chk = cc.new_gpz();
				cc.movsxd(chk, rr.r32()); cc.cmp(chk, rr);
				Label no_ovf = cc.new_label();
				cc.je(no_ovf);
				cc.or_(x86::dword_ptr(dev, off_st1), Imm(tms57002_device::jit_st1_aov()));
				Label no_clamp = cc.new_label();
				cc.test(x86::dword_ptr(dev, off_st1), Imm(tms57002_device::jit_st1_aovm()));
				cc.jz(no_clamp);
				x86::Gp hi = cc.new_gpz(), lo = cc.new_gpz();
				cc.mov(hi, Imm(2147483647LL)); cc.cmp(rr, hi); cc.cmovg(rr, hi);
				cc.mov(lo, Imm(-2147483648LL)); cc.cmp(rr, lo); cc.cmovl(rr, lo);
				cc.bind(no_clamp);
				cc.bind(no_ovf);
			}
			cc.mov(x86::dword_ptr(dev, off_aacc), rr.r32());               // aacc = (u32)rr
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{
				InvokeNode *ms = nullptr;
				cc.invoke(Out(ms), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>());
				ms->set_arg(0, dev); ms->set_arg(1, Imm(op)); ms->set_arg(2, Imm(icd_addr));
			}
			macc_in();
			cc.bind(doneop);
		}
		else if (op == 1844 || op == 1845 || op == 1846)
		{
			// sfmo 1/2/3: st1 = (st1 & ~ST1_SFMO) | (val << shift). st1 write, no macc.
			const int off_st1 = int(tms57002_device::jit_off_st1());
			const u32 val = (op == 1844) ? 1u : (op == 1845) ? 2u : 3u;
			cc.and_(x86::dword_ptr(dev, off_st1), Imm(~tms57002_device::jit_st1_sfmo()));
			cc.or_(x86::dword_ptr(dev, off_st1), Imm(val << tms57002_device::jit_st1_sfmo_shift()));
		}
		else if (op == 1837 || op == 1838)
		{
			// sfai clear (1837) / set (1838).
			const int off_st1 = int(tms57002_device::jit_off_st1());
			if (op == 1837) cc.and_(x86::dword_ptr(dev, off_st1), Imm(~tms57002_device::jit_st1_sfai()));
			else            cc.or_(x86::dword_ptr(dev, off_st1), Imm(tms57002_device::jit_st1_sfai()));
		}
		else if (op == 1132)
		{
			// sfml: macc = (macc & 0x8000000000000) | ((macc << 1) & 0x7ffffffffffff). Register-resident.
			x86::Gp hi = cc.new_gpz(), m = cc.new_gpz();
			cc.mov(m, Imm(0x8000000000000LL)); cc.mov(hi, r_macc); cc.and_(hi, m);
			cc.shl(r_macc, Imm(1));
			cc.mov(m, Imm(0x7ffffffffffffLL)); cc.and_(r_macc, m);
			cc.or_(r_macc, hi);
		}
		else if (op == 868 || op == 920)
		{
			// and/xor cmode=1: aacc &= / ^= get_cmem(ca). No macc. Fast cmem[ca]; DEOPT if pending.
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_ca = int(tms57002_device::jit_off_ca());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp cai = cc.new_gpz(); cc.movzx(cai, x86::byte_ptr(dev, off_ca));
			x86::Gp c = cc.new_gp32(); cc.mov(c, x86::dword_ptr(dev, cai, 2, off_cmem));
			if (op == 868) cc.and_(x86::dword_ptr(dev, off_aacc), c);
			else           cc.xor_(x86::dword_ptr(dev, off_aacc), c);
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *mx = nullptr; cc.invoke(Out(mx), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); mx->set_arg(0, dev); mx->set_arg(1, Imm(op)); mx->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(doneop);
		}
		else if (op == 859)
		{
			// and dmode=0: aacc &= (dmem0[(param+ba0)&0xff] << 8). No cmem/macc.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			x86::Gp addr = cc.new_gpz(); cc.movzx(addr, x86::byte_ptr(dev, off_ba0)); cc.add(addr, Imm(param)); cc.and_(addr, Imm(0xff));
			x86::Gp d = cc.new_gp32(); cc.mov(d, x86::dword_ptr(dev, addr, 2, off_dmem0)); cc.shl(d, Imm(8));
			cc.and_(x86::dword_ptr(dev, off_aacc), d);
		}
		else if (op == 6)
		{
			// neg: aacc = %wa( -(int64)aacc ).  (int64)aacc is ZERO-extended (aacc is u32).
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			x86::Gp rr = cc.new_gpz();
			cc.mov(rr.r32(), x86::dword_ptr(dev, off_aacc));   // zero-extend u32 aacc into rr
			cc.neg(rr);
			emit_wa(rr);
		}
		else if (op == 8 || op == 428)
		{
			// add(8)/sub(428) dmode=0: aacc = %wa( (int32)(dmem0[(param+ba0)&0xff]<<8) +/- (int32)aacc ).
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			x86::Gp addr = cc.new_gpz(); cc.movzx(addr, x86::byte_ptr(dev, off_ba0)); cc.add(addr, Imm(param)); cc.and_(addr, Imm(0xff));
			x86::Gp d = cc.new_gp32(); cc.mov(d, x86::dword_ptr(dev, addr, 2, off_dmem0)); cc.shl(d, Imm(8));
