joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
			x86::Gp rr = cc.new_gpz(); cc.movsxd(rr, d);
			x86::Gp ra = cc.new_gpz(); cc.movsxd(ra, x86::dword_ptr(dev, off_aacc));
			if (op == 8) cc.add(rr, ra); else cc.sub(rr, ra);
			emit_wa(rr);
		}
		else if (op == 4)
		{
			// abs: if((int32)aacc < 0){ aacc = -aacc; if((int32)aacc < 0) st1 |= ST1_AOV; }
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_st1 = int(tms57002_device::jit_off_st1());
			x86::Gp a = cc.new_gp32(); cc.mov(a, x86::dword_ptr(dev, off_aacc));
			Label done = cc.new_label();
			cc.test(a, a); cc.jns(done);
			cc.neg(a); cc.mov(x86::dword_ptr(dev, off_aacc), a);
			cc.test(a, a); cc.jns(done);
			cc.or_(x86::dword_ptr(dev, off_st1), Imm(tms57002_device::jit_st1_aov()));
			cc.bind(done);
		}
		else if (op == 380)
		{
			// add 380 cmode=0 sfmo=0: aacc = %wa( (int32)get_cmem(param) + (macc_read >> 16) ).
			// macc_to_output_0s(0,~0,0) common path == macc_read; DEOPT on macc overflow (rare:
			// st1|=ST1_MOV + clip) or pending cmem update. Validates the %mo (macc-output) pattern.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			// macc overflow -> deopt: m1 = macc_read & 0xf800000000000; over if m1 != 0 && m1 != mask
			{
				x86::Gp m1 = cc.new_gpz(), mask = cc.new_gpz();
				cc.mov(mask, Imm(0xf800000000000LL)); cc.mov(m1, r_macc_r); cc.and_(m1, mask);
				Label no_ovf = cc.new_label();
				cc.jz(no_ovf); cc.cmp(m1, mask); cc.jne(deopt);
				cc.bind(no_ovf);
			}
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			x86::Gp mo = cc.new_gpz(); cc.mov(mo, r_macc_r); cc.sar(mo, Imm(16));   // macc_read >> 16
			x86::Gp rr = cc.new_gpz(); cc.movsxd(rr, x86::dword_ptr(dev, off_cmem + int(param) * 4));  // (int32)cmem[param]
			cc.add(rr, mo);
			emit_wa(rr);
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *ma = nullptr; cc.invoke(Out(ma), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); ma->set_arg(0, dev); ma->set_arg(1, Imm(op)); ma->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(doneop);
		}
		else if (op == 1144)
		{
			// sacc cmode=0: cmem[param] = aacc  (direct DSP cmem write; the queue is only for H8 uploads).
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_aacc = int(tms57002_device::jit_off_aacc());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			x86::Gp v = cc.new_gp32(); cc.mov(v, x86::dword_ptr(dev, off_aacc));
			cc.mov(x86::dword_ptr(dev, off_cmem + int(param) * 4), v);
		}
		else if (op == 1768)
		{
			// smhc 1768 cmode=0 sfmo=0: cmem[param] = (u32)(macc_read >> 16). DEOPT on macc overflow.
			const u8 param = u8(dsp.jit_inst_param(cur));
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			Label deopt = cc.new_label(), doneop = cc.new_label();
			{ x86::Gp m1 = cc.new_gpz(), mask = cc.new_gpz(); cc.mov(mask, Imm(0xf800000000000LL)); cc.mov(m1, r_macc_r); cc.and_(m1, mask); Label no_ovf = cc.new_label(); cc.jz(no_ovf); cc.cmp(m1, mask); cc.jne(deopt); cc.bind(no_ovf); }
			x86::Gp mo = cc.new_gpz(); cc.mov(mo, r_macc_r); cc.sar(mo, Imm(16));
			cc.mov(x86::dword_ptr(dev, off_cmem + int(param) * 4), mo.r32());   // cmem[param] = (u32)(macc_read>>16)
			cc.jmp(doneop);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *msc = nullptr; cc.invoke(Out(msc), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); msc->set_arg(0, dev); msc->set_arg(1, Imm(op)); msc->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(doneop);
		}
		else if (op == 1143 || op == 1142 || op == 1135)
		{
			// rde (1143 ca / 1142 param) / wre (1135 ca): arm the XRAM transaction.
			//   if (sti & (S_READ|S_WRITE)) return;   [wre: xwr = dmem0[(param+ba0)&0xff];]
			//   xoa = get_cmem(ca|param);  xm_init();  sti |= S_READ|S_WRITE;
			const u8 param = u8(dsp.jit_inst_param(cur));
			const bool is_wre = (op == 1135);
			const bool by_ca = (op == 1143 || op == 1135);
			const int off_xoa = int(tms57002_device::jit_off_xoa());
			const int off_xwr = int(tms57002_device::jit_off_xwr());
			const int off_ca = int(tms57002_device::jit_off_ca());
			const int off_cmem = int(tms57002_device::jit_off_cmem());
			const int off_dmem0 = int(tms57002_device::jit_off_dmem0());
			const int off_ba0 = int(tms57002_device::jit_off_ba0());
			const int off_uch = int(tms57002_device::jit_off_uc_head());
			const int off_uct = int(tms57002_device::jit_off_uc_tail());
			const int off_force = int(tms57002_device::jit_off_cmem_force());
			const u32 flag = is_wre ? tms57002_device::jit_s_write_mask() : tms57002_device::jit_s_read_mask();
			Label skip = cc.new_label(), deopt = cc.new_label(), done = cc.new_label();
			{ x86::Gp s = cc.new_gp32(); cc.mov(s, x86::dword_ptr(dev, off_sti)); cc.test(s, Imm(rw_mask)); cc.jnz(skip); }   // transaction pending -> nop
			{ x86::Gp h = cc.new_gp32(), t = cc.new_gp32(); cc.movzx(h, x86::byte_ptr(dev, off_uch)); cc.movzx(t, x86::byte_ptr(dev, off_uct)); cc.cmp(h, t); cc.jne(deopt); }
			{ x86::Gp f = cc.new_gp32(); cc.movzx(f, x86::byte_ptr(dev, off_force)); cc.test(f, f); cc.jnz(deopt); }
			if (is_wre) {
				x86::Gp addr = cc.new_gpz(); cc.movzx(addr, x86::byte_ptr(dev, off_ba0)); cc.add(addr, Imm(param)); cc.and_(addr, Imm(0xff));
				x86::Gp xw = cc.new_gp32(); cc.mov(xw, x86::dword_ptr(dev, addr, 2, off_dmem0)); cc.mov(x86::dword_ptr(dev, off_xwr), xw);   // xwr = dmem0[..]
			}
			x86::Gp v = cc.new_gp32();
			if (by_ca) { x86::Gp cai = cc.new_gpz(); cc.movzx(cai, x86::byte_ptr(dev, off_ca)); cc.mov(v, x86::dword_ptr(dev, cai, 2, off_cmem)); }
			else       cc.mov(v, x86::dword_ptr(dev, off_cmem + int(param) * 4));
			cc.mov(x86::dword_ptr(dev, off_xoa), v);   // xoa = get_cmem(ca|param)
			{ InvokeNode *xi = nullptr; cc.invoke(Out(xi), uint64_t(&jit_w_xm_init), FuncSignature::build<void, tms57002_device *>()); xi->set_arg(0, dev); }   // xm_init() (no macc touch)
			cc.or_(x86::dword_ptr(dev, off_sti), Imm(flag));   // sti |= S_READ / S_WRITE
			cc.jmp(done);
			cc.bind(deopt);
			macc_out();
			{ InvokeNode *mr = nullptr; cc.invoke(Out(mr), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>()); mr->set_arg(0, dev); mr->set_arg(1, Imm(op)); mr->set_arg(2, Imm(icd_addr)); }
			macc_in();
			cc.bind(skip);
			cc.bind(done);
		}
		else
		{
			macc_out();   // un-inlined op may read/write macc -> sync around the call
			InvokeNode *m = nullptr;
			cc.invoke(Out(m), uint64_t(&jit_w_op), FuncSignature::build<void, tms57002_device *, unsigned, const void *>());
			m->set_arg(0, dev);
			m->set_arg(1, Imm(op));
			m->set_arg(2, Imm(icd_addr));
			macc_in();
			x86::Gp sti = cc.new_gp32("sti");
			cc.mov(sti, x86::dword_ptr(dev, off_sti));
			cc.test(sti, Imm(idle_mask));
			cc.jnz(chain_end);
		}
		cur = next;
	}
	cc.bind(chain_end);
	ok = true;
	return chain_ipc;
}

// Register-cached post (x86): pc + icount live in regs across the frame. Fast path icount--/pc++ as
// register ops; deopt to jit_w_post (sync regs, call, reload) on pending-transfer/rptc/rptc_next/
// S_BRANCH/pc0-transition or when the serial model is on. Returns the next-ipc reg.
static asmjit::x86::Gp emit_post_regcached(asmjit::x86::Compiler &cc, asmjit::x86::Gp dev, tms57002_device &dsp,
	int iipc, asmjit::x86::Gp chain_ipc, asmjit::x86::Gp reg_pc, asmjit::x86::Gp reg_icount)
{
	using namespace asmjit;
	x86::Gp next = cc.new_gp32("next");
	const int off_pc = int(tms57002_device::jit_off_pc());
	const int off_ic = int(tms57002_device::jit_off_icount());

	auto sync_call_reload = [&]() {
		cc.mov(x86::byte_ptr(dev, off_pc), reg_pc.r8());     // sync cached pc/icount for the C++ post
		cc.mov(x86::dword_ptr(dev, off_ic), reg_icount);
		x86::Gp r = emit_post_call(cc, dev, iipc, chain_ipc);
		cc.mov(next, r);
		cc.movzx(reg_pc, x86::byte_ptr(dev, off_pc));         // reload what the C++ post changed
		cc.mov(reg_icount, x86::dword_ptr(dev, off_ic));
	};

	if (dsp.jit_serial_model()) { sync_call_reload(); return next; }

	const int off_pend = int(tms57002_device::jit_off_pending_pre_transfer());
	const int off_rptc = int(tms57002_device::jit_off_rptc());
	const int off_rptcn = int(tms57002_device::jit_off_rptc_next());
	const int off_sti = int(tms57002_device::jit_off_sti());
	const u32 branch_mask = tms57002_device::jit_s_branch_mask();
	Label slow = cc.new_label(), done2 = cc.new_label();

	{ x86::Gp t = cc.new_gp32(); cc.movzx(t, x86::byte_ptr(dev, off_pend)); cc.test(t, t); cc.jnz(slow); }
	{ x86::Gp t = cc.new_gp32(); cc.movzx(t, x86::byte_ptr(dev, off_rptc)); cc.test(t, t); cc.jnz(slow); }
	{ x86::Gp t = cc.new_gp32(); cc.movzx(t, x86::byte_ptr(dev, off_rptcn)); cc.test(t, t); cc.jnz(slow); }
	{ x86::Gp t = cc.new_gp32(); cc.mov(t, x86::dword_ptr(dev, off_sti)); cc.test(t, Imm(branch_mask)); cc.jnz(slow); }
	cc.test(reg_pc, reg_pc); cc.jz(slow);          // pc==0  -> pc0 transition
	cc.cmp(reg_pc, Imm(255)); cc.je(slow);         // pc==255 -> pc0 transition

	cc.sub(reg_icount, Imm(1));   // FAST PATH, registers only
	cc.add(reg_pc, Imm(1));
	cc.mov(next, chain_ipc);
	cc.jmp(done2);

