joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	cc.bind(slow);
	sync_call_reload();
	cc.bind(done2);
	return next;
}

Jit::PcFn Jit::compile_pc(tms57002_device &, int) { return nullptr; }   // x86-64: per-PC path not used (compile_frame is)

#else   // neither arch
Jit::PcFn Jit::compile_pc(tms57002_device &, int) { return nullptr; }
#endif

Jit::PcFn Jit::get_pc_fn(tms57002_device &dsp, int ipc)
{
	if (ipc < 0)
		return nullptr;
	if (size_t(ipc) >= m_pc_fns.size())
		m_pc_fns.resize(size_t(ipc) + 1, nullptr);
	if (m_pc_fns[ipc])
		return m_pc_fns[ipc];   // O(1) flat lookup, no hash
	PcFn fn = compile_pc(dsp, ipc);
	if (fn)
		m_pc_fns[ipc] = fn;     // only cache success; a failed compile sets m_pc_native_failed in the caller
	return fn;
}

std::array<u32, 4> Jit::run_sample_native(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	if (m_pc_native_failed)
		return run_sample(dsp, in, max_steps);
	dsp.jit_begin_frame(in);
	dsp.jit_set_icount(max_steps);
	int ipc = -1;
	int guard = (max_steps > 0 ? max_steps : 1) + 16;
	while (dsp.jit_running() && guard-- > 0)
	{
		if (ipc == -1)
			ipc = dsp.jit_decode_current();
		PcFn fn = get_pc_fn(dsp, ipc);
		if (!fn)
		{
			m_pc_native_failed = true;   // codegen unavailable -> interpreter from here on
			while (dsp.jit_running() && guard-- > 0)
			{
				if (ipc == -1)
					ipc = dsp.jit_decode_current();
				ipc = dsp.jit_run_chain(ipc);
			}
			break;
		}
		ipc = fn(&dsp);
	}
	dsp.jit_finalize_if_idle();
	return dsp.jit_end_frame();
}

// Whole-frame compile: ONE native void(device) function, every PC's body inlined (no per-PC
// calls). The linear PC sequence (pc++) is unrolled at compile time by decoding each pc; after
// each PC a safety check (runtime next-ipc == compile-time-expected linear next) bails to the
// interpreter for the REST of the frame on any branch/repeat. Idle ends the frame early. If the
// program is linear (DSP1), the whole frame runs with zero per-PC call overhead.
Jit::FrameFn Jit::compile_frame(tms57002_device &dsp, int max_steps, int start_pc)
{
#ifdef KPROP_JIT_A64
	using namespace asmjit;

	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	a64::Compiler cc(&code);
	FuncNode *fn = cc.add_func(FuncSignature::build<void, tms57002_device *>());
	if (!fn)
		return nullptr;

	a64::Gp dev = cc.new_gpz("dev");
	fn->set_arg(0, dev);

	const int off_sti = int(tms57002_device::jit_off_sti());
	const unsigned idle_bit = __builtin_ctz(tms57002_device::jit_s_idle_mask());

	Label done = cc.new_label();
	Label fallback = cc.new_label();
	a64::Gp fb_ipc = cc.new_gp32("fb_ipc");

	const int nsteps = int(m_frame_trace.size());
	if (nsteps == 0)
		return nullptr;   // no trace recorded -> fall back to the per-PC interpreter
	(void)max_steps; (void)start_pc;
	for (int k = 0; k < nsteps; k++)
	{
		const int ipc_k = m_frame_trace[k];   // chain head recorded at this PC's RUNTIME st1 (not frame-start)

		bool ok = true;
		a64::Gp chain_ipc = emit_pc_body(cc, dev, dsp, ipc_k, ok);   // PC body INLINE (no call)
		if (!ok)
			return nullptr;
		a64::Gp next = emit_post_call(cc, dev, ipc_k, chain_ipc);   // post (memory-based for now)

		// Idle ends the frame (matches the interpreter's top-of-loop !(sti & S_IDLE) test).
		{
			a64::Gp sti = cc.new_gp32("sti");
			cc.ldr(sti, a64::ptr(dev, off_sti));
			cc.tbnz(sti, Imm(idle_bit), done);
		}

		// Safety: next ipc must be the compile-time-expected linear next; else the program
		// branched/repeated -> finish the rest of the frame via the interpreter from the real ipc.
		if (k < nsteps - 1)
		{   // chain-consistent next (walk ipc_k's chain to its terminator's next), matching the x86 path
			int expected = ipc_k;
			for (int s = 0; s <= 64; s++) {
				const unsigned cop = dsp.jit_inst_op(expected);
				const int nx = dsp.jit_inst_next(expected);
				expected = nx;
				if (cop < 4) break;
			}
			cc.mov(fb_ipc, next);
			a64::Gp tmp = cc.new_gp32("tmp");
			cc.sub(tmp, next, Imm(expected));
			cc.cbnz(tmp, fallback);
		}
	}
	cc.b(done);

	cc.bind(fallback);
	{
		InvokeNode *r = nullptr;
		cc.invoke(Out(r), uint64_t(&jit_w_run_rest), FuncSignature::build<void, tms57002_device *, int>());
		r->set_arg(0, dev);
		r->set_arg(1, fb_ipc);
	}
	// fall through to done

	cc.bind(done);
	cc.ret();
	cc.end_func();
	if (cc.finalize() != kErrorOk)
		return nullptr;

	FrameFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk)
		return nullptr;
	return out;

#elif defined(KPROP_JIT_X64)
	using namespace asmjit;
	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	x86::Compiler cc(&code);
	FuncNode *fn = cc.add_func(FuncSignature::build<void, tms57002_device *>());
	if (!fn)
		return nullptr;
	x86::Gp dev = cc.new_gpz("dev");
	fn->set_arg(0, dev);
	const int off_sti = int(tms57002_device::jit_off_sti());
	const u32 idle_mask = tms57002_device::jit_s_idle_mask();
	const int off_pc = int(tms57002_device::jit_off_pc());
	const int off_ic = int(tms57002_device::jit_off_icount());
	Label done = cc.new_label();
	Label fallback = cc.new_label();
	x86::Gp fb_ipc = cc.new_gp32("fb_ipc");
	// Register-cache pc + icount across the frame (ops never touch them -> no sync around jit_w_op).
	x86::Gp reg_pc = cc.new_gp32("reg_pc");
	x86::Gp reg_icount = cc.new_gp32("reg_icount");
	cc.movzx(reg_pc, x86::byte_ptr(dev, off_pc));
	cc.mov(reg_icount, x86::dword_ptr(dev, off_ic));
	// Register-cache the MACC pipeline across the frame (emit_pc_body syncs around jit_w_op/jit_w_xm).
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	x86::Gp reg_macc = cc.new_gpz("reg_macc"), reg_macc_r = cc.new_gpz("reg_macc_r"), reg_macc_w = cc.new_gpz("reg_macc_w");
	cc.mov(reg_macc, x86::qword_ptr(dev, off_macc));
	cc.mov(reg_macc_r, x86::qword_ptr(dev, off_macc_r));
	cc.mov(reg_macc_w, x86::qword_ptr(dev, off_macc_w));

	const int nsteps = int(m_frame_trace.size());
	if (nsteps == 0)
		return nullptr;   // no trace recorded -> fall back to the per-PC interpreter
	(void)max_steps; (void)start_pc;
	for (int k = 0; k < nsteps; k++)
	{
		const int ipc_k = m_frame_trace[k];   // chain head recorded at this PC's RUNTIME st1 (not frame-start)
		bool ok = true;
		x86::Gp chain_ipc = emit_pc_body(cc, dev, dsp, ipc_k, ok, reg_macc, reg_macc_r, reg_macc_w);
		if (!ok)
			return nullptr;
		x86::Gp next = emit_post_regcached(cc, dev, dsp, ipc_k, chain_ipc, reg_pc, reg_icount);

		{   // idle ends the frame
			x86::Gp sti = cc.new_gp32("sti");
			cc.mov(sti, x86::dword_ptr(dev, off_sti));
			cc.test(sti, Imm(idle_mask));
			cc.jnz(done);
		}
		if (k < nsteps - 1)
		{   // safety: the runtime next-ipc must match what pc_k's compiled chain LINKS to (its
			// chain-consistent next), NOT a fresh jit_decode(pc_next). The (pc,st1)-keyed decode
			// cache hands back inconsistent cache indices for diverse programs, which falsely
			// tripped this guard for real firmware (chain next=5 vs jit_decode=591) and forced the
			// whole frame to interpret. The compiled tail falls through to pc_{k+1}'s body either
			// way; the guard only needs to catch a runtime post (deopt) diverging from the linear
			// chain (a genuine branch/repeat), where next != the chain's terminator-next.
			int expected = ipc_k;
			for (int s = 0; s <= 64; s++) {
				const unsigned cop = dsp.jit_inst_op(expected);
				const int nx = dsp.jit_inst_next(expected);
				expected = nx;
				if (cop < 4) break;   // chain terminator -> expected = its next = the chain-consistent next
			}
			cc.mov(fb_ipc, next);
			cc.cmp(next, Imm(expected));
			cc.jne(fallback);
		}
	}
	cc.jmp(done);

	cc.bind(fallback);
	cc.mov(x86::byte_ptr(dev, off_pc), reg_pc.r8());     // sync cached state before the interpreter finishes
	cc.mov(x86::dword_ptr(dev, off_ic), reg_icount);
	cc.mov(x86::qword_ptr(dev, off_macc), reg_macc);
	cc.mov(x86::qword_ptr(dev, off_macc_r), reg_macc_r);
	cc.mov(x86::qword_ptr(dev, off_macc_w), reg_macc_w);
	{
		InvokeNode *r = nullptr;
		cc.invoke(Out(r), uint64_t(&jit_w_run_rest), FuncSignature::build<void, tms57002_device *, int>());
		r->set_arg(0, dev);
		r->set_arg(1, fb_ipc);
	}
	cc.movzx(reg_pc, x86::byte_ptr(dev, off_pc));         // reload after the interpreter advanced them
	cc.mov(reg_icount, x86::dword_ptr(dev, off_ic));
	cc.mov(reg_macc, x86::qword_ptr(dev, off_macc));
	cc.mov(reg_macc_r, x86::qword_ptr(dev, off_macc_r));
	cc.mov(reg_macc_w, x86::qword_ptr(dev, off_macc_w));

