joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	cc.bind(done);
	cc.mov(x86::byte_ptr(dev, off_pc), reg_pc.r8());      // write cached state back for finalize/end_frame
	cc.mov(x86::dword_ptr(dev, off_ic), reg_icount);
	cc.mov(x86::qword_ptr(dev, off_macc), reg_macc);
	cc.mov(x86::qword_ptr(dev, off_macc_r), reg_macc_r);
	cc.mov(x86::qword_ptr(dev, off_macc_w), reg_macc_w);
	cc.ret();
	cc.end_func();
	if (cc.finalize() != kErrorOk)
		return nullptr;
	// M2 sizing: the UNROLLED resident frame's code size (x3 vs the 32KB L1I decides if fusion needs
	// a shared op-body pool). One-time per distinct trace length.
	{ static size_t last = 0; if (code.code_size() != last) { last = code.code_size(); std::fprintf(stderr, "[frame-size] unrolled resident frame: %zu bytes (%d trace steps) -> x3 fused = %zu bytes vs 32KB L1I\n", code.code_size(), nsteps, code.code_size() * 3); } }
	FrameFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk)
		return nullptr;
	return out;

#else
	return nullptr;
#endif
}

std::array<u32, 4> Jit::run_sample_frame_native(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	if (m_frame_failed)
		return run_sample_native(dsp, in, max_steps);   // before begin_frame (no double-begin)

	dsp.jit_begin_frame(in);
	dsp.jit_set_icount(max_steps);
	const int ms = max_steps > 0 ? max_steps : 1;
	const int start_pc = dsp.jit_pc();
	// Key the compiled frame by the starting st1 CACHE bits too: they select op variants and evolve
	// across frames (frame 0 starts at the loaded st1, later frames at the program's steady state),
	// so a trace recorded under one starting-mode is invalid under another. Recompile when they change;
	// a stable program settles after ~1 frame, so steady-state frames reuse one compiled fn.
	const u32 start_st1 = dsp.dbg_st1() & tms57002_device::jit_st1_cache();

	if (!m_frame_fn || m_frame_max_steps != ms || m_frame_start_pc != start_pc || m_frame_start_st1 != start_st1)
	{
		// RECORD the per-PC decode trace by INTERPRETING this frame: re-decode each PC at its running
		// st1 (jit_decode_current), so compile_frame compiles the variant each PC actually runs. The
		// TMS57002 decode is st1-mode-dependent and st1 evolves mid-frame; the old code decoded every
		// PC at frame-start st1 and emitted/deopted the wrong variant. This frame's output is the
		// interpreter's (correct); the compiled fn (built from the trace) runs subsequent frames.
		// Branch-free program => the decode trace is identical every frame, so recording once is valid.
		m_frame_trace.clear();
		int guard = ms + 16;
		while (dsp.jit_running() && int(m_frame_trace.size()) < ms && guard-- > 0)
		{
			const int ipc = dsp.jit_decode_current();
			m_frame_trace.push_back(ipc);
			dsp.jit_run_chain(ipc);
		}
		dsp.jit_finalize_if_idle();
		const auto result = dsp.jit_end_frame();   // this frame ran (interpreted) while recording

		m_frame_fn = compile_frame(dsp, ms, start_pc);   // compiles from m_frame_trace
		m_frame_max_steps = ms;
		m_frame_start_pc = start_pc;
		m_frame_start_st1 = start_st1;
		if (!m_frame_fn)
			m_frame_failed = true;   // codegen unavailable -> per-PC interpreter from now on
		return result;
	}
	m_frame_fn(&dsp);
	dsp.jit_finalize_if_idle();
	return dsp.jit_end_frame();
}

// M2: the pooled+pinned whole-frame emit. Hand-written x86-64 (asmjit Assembler) with a private
// calling convention — macc/macc_read/macc_write/aacc PINNED in callee-saved regs (r12/r13/r14/r15)
// and dev in rbx — so C-ABI helper calls (jit_w_xm/jit_w_post) preserve them automatically and only
// a DEOPT (jit_w_op, which mutates device macc/aacc in memory) needs a spill/reload. THIS skeleton
// deopts EVERY op (proving the convention + machinery + post + fallback bit-exact); the next step
// replaces the deopt with CALLs into a shared op-body pool (the residency + fusion-viability win).
// M3: build the program-order (pc, chain-head ipc) list the pooled frame compiles from — EVERY PC from
// start to the program's idle, in program order, each decoded at its DETERMINISTIC st1 mode. The st1
// mode per PC is path-independent (the st1 de-risk proved no branch skips a mode-setter). See the body
// comment for the mechanism (a decode-only, chaining-disabled walk; the decoder itself evolves st1).
void Jit::build_pooled_order(tms57002_device &dsp, int start_pc, int max_steps)
{
	// Program-order DECODE-ONLY walk. Key fact: the TMS57002 decoder mutates st1's mode-select fields
	// (sfmo/sfai/sfao/sfma/scrm/rnd/rmom/smom/ldpk) AT DECODE TIME (the CDEC tables), and those mode
	// fields are the ONLY st1 bits that pick op variants (ST1_CACHE) — verified: no execution-only op
	// writes a decode-key bit. So decoding each PC in program order, with decode-CHAINING DISABLED (one
	// PC per decode_get_pc call), evolves st1 exactly as the interpreter's decoder does and yields the
	// correct variant for every PC at its deterministic runtime st1 — with ZERO op execution (no data /
	// XRAM / serial side effects, so nothing to corrupt). This replaces the old flag-setter replay, whose
	// bug was calling decode_get_pc with chaining ON: that decodes a whole RUN of PCs at once and
	// over-advances st1 past the current PC (e.g. decoding a downstream smhd at sfmo=2 instead of 0).
	// Branches are walked as fall-through (linear p++); the st1 de-risk proved no branch skips a
	// mode-setter, so program order visits every reachable PC at the correct (path-independent) st1.
	// Non-destructive: the snapshot restores st1/pc; the decode-cache entries built here are reused (as
	// cache hits) by the interpret that runs next, so the recorded (pc,ipc) stay valid for compile.
	m_pooled_order.clear();
	m_pooled_order_mode_safe = true;
	const auto snap = dsp.debug_capture_snapshot();
	const bool save_chain = dsp.jit_disable_chaining();
	dsp.jit_set_disable_chaining(true);
	dsp.jit_cache_flush();
	int p = start_pc & 0xff;
	const int lim = (max_steps > 0 ? max_steps : 1);
	// Mode-safety bookkeeping: the fall-through walk is only valid if no branch skips a mode-setter
	// (st1-per-PC path-independence). Record the st1 CACHE state on arrival at each order index and
	// every branch edge (order index -> target pc); verified below. Sufficient condition: for every
	// branch k -> target j, mode_after_decode(k) == mode_at_entry(j) — then any executed path (linear
	// segments joined by taken branches) evolves st1 exactly as this linear walk did, by induction
	// over segments. A violation means the compiled variants could be wrong for some path -> the
	// program is marked mode-unsafe and compile_frame_pooled refuses it (runs via interpreter).
	std::vector<u32> mode_at_entry;
	std::vector<std::pair<int, int>> branch_edges;   // (order index of the branch, target pc)
	const u32 st1_cache_mask = tms57002_device::jit_st1_cache();
	for (int steps = 0; steps < lim && steps < 256; steps++)
	{
		dsp.jit_set_pc(u8(p));
		mode_at_entry.push_back(dsp.dbg_st1() & st1_cache_mask);
		const int ipc = dsp.jit_decode_current();   // decodes ONLY p (chaining off); mutates st1 by p's mode-setter
		m_pooled_order.push_back({ p, ipc });
		bool idle = false;
		int cur = ipc;
		for (int s = 0; s <= 64; s++)
		{
			const unsigned op = dsp.jit_inst_op(cur);
			if (op >= 4)
			{
				const char *mn = dsp.jit_op_mnemonic(op);
				if (mn && __builtin_strcmp(mn, "idle") == 0) idle = true;
				if (mn && (__builtin_strcmp(mn, "b") == 0 || __builtin_strcmp(mn, "bgz") == 0
					|| __builtin_strcmp(mn, "blz") == 0 || __builtin_strcmp(mn, "bnz") == 0
					|| __builtin_strcmp(mn, "bv") == 0))
					branch_edges.emplace_back(int(m_pooled_order.size()) - 1, int(dsp.jit_inst_param(cur)) & 0xff);
			}
			if (op < 4) break;
			cur = dsp.jit_inst_next(cur);
		}
		if (idle) break;
		p = (p + 1) & 0xff;
	}
	const u32 mode_final = dsp.dbg_st1() & st1_cache_mask;   // state after the LAST pc's decode
	dsp.jit_set_disable_chaining(save_chain);
	dsp.debug_restore_snapshot(snap);

	const int n = int(m_pooled_order.size());
	// Branch-target order indices, for the F5-refinement window-overlap guard below.
	std::vector<bool> is_btarget(size_t(n ? n : 1), false);
	for (const auto &e : branch_edges)
	{
		const int tj = (e.second - (start_pc & 0xff)) & 0xff;
		if (tj < n) is_btarget[size_t(tj)] = true;
	}
	for (const auto &e : branch_edges)
	{
		const int k = e.first;
		const int tj = (e.second - (start_pc & 0xff)) & 0xff;   // target's order index (order is linear from start_pc)
		const u32 after_k = (k + 1 < n) ? mode_at_entry[k + 1] : mode_final;
		if (tj >= n)
		{
			m_pooled_order_mode_safe = false;   // target outside the order (compile would fail anyway)
			break;
		}
		const u32 diff0 = mode_at_entry[tj] ^ after_k;
		if (diff0 == 0)
			continue;   // arrival mode states match exactly — the common case
		// F5 REFINEMENT (2026-07-07; spec = 07-05 audit note §4). The branch path arrives at the
		// target with mode state differing from the fall-through walk's by diff0. That is harmful
		// ONLY if some op decoded between the join and the reconvergence point actually CONSUMED a
		// differing field — i.e. its (mnemonic, id) family enumerates that field, so the interpreter
		// would have decoded a DIFFERENT op-id on the branch path than the one this walk baked.
		// Walk forward from the target, shrinking `diff` at each mode-setter: both paths execute the
		// SAME setter op-id (its own consumption is checked first), writing the same immediate, so
		// the fields it rewrites become path-independent. Refuse (conservatively) on: a consumer of
		// a differing field, a branch originating or landing inside the unreconverged window, or a
		// diff that survives to the end of the program (the next frame's start_st1 cache key would
		// become path-dependent — the re-prime-storm class from the F1 post-mortem).
		// NOTE 2026-07-05: the korgprop boot-window program branches pc 18 -> 22 with diff=ST1_SFMO;
		// whether it is admitted now depends on whether any %mo/%mn/%mv consumer sits before the
		// next sfmo write — decided here per edge instead of refusing the whole program.
		const char *refuse = nullptr;
		int reconv_pc = -1;
		u32 diff = diff0;
		for (int i = tj; i < n && diff && !refuse; i++)
		{
			if (i != tj && is_btarget[size_t(i)])
			{
				refuse = "another branch lands in the window";
				break;
			}
			int cur = m_pooled_order[i].second;
			for (int s = 0; s <= 64 && diff; s++)
			{
				const unsigned op = dsp.jit_inst_op(cur);
				if (op < 4)
					break;
				const char *mn = dsp.jit_op_mnemonic(op);
				if (!mn) { refuse = "unknown op in the window"; break; }
				if (__builtin_strcmp(mn, "b") == 0 || __builtin_strcmp(mn, "bgz") == 0
					|| __builtin_strcmp(mn, "blz") == 0 || __builtin_strcmp(mn, "bnz") == 0
					|| __builtin_strcmp(mn, "bv") == 0)
				{ refuse = "a branch originates in the window"; break; }
				if (tms57002::op_mode_consumed_mask(op) & diff)
				{ refuse = "an op variant consumes a differing mode field"; break; }
				if (tms57002::op_is_mode_setter(op))
				{
					const void *icd = reinterpret_cast<const void *>(dsp.jit_inst_addr(cur));
					const u32 v0 = dsp.jit_probe_st1(op, icd, 0x00000000u);
					const u32 vF = dsp.jit_probe_st1(op, icd, 0xffffffffu);
					diff &= vF & ~v0;   // keep-mask: the setter's fields are now path-independent
				}
				cur = dsp.jit_inst_next(cur);
			}
			if (!diff) reconv_pc = m_pooled_order[i].first;
		}
		if (diff && !refuse)
			refuse = "the mode diff survives to the end of the program";
		// Log once per (program, edge, outcome): admitted programs get RE-PRIMED per program switch
		// and this analysis reruns each time — don't spam stderr.
		static std::set<u64> s_logged;
		const u64 log_key = m_cur_prog_hash ^ (u64(m_pooled_order[k].first) << 16)
			^ (u64(e.second) << 8) ^ (refuse ? 1u : 0u);
		if (!refuse)
		{
			if (s_logged.insert(log_key).second)
				std::fprintf(stderr, "[pooled] F5: branch pc %02x -> pc %02x mode diff %06x is BENIGN (no consumer; reconverges by pc %02x) -> pooled (prog %016llx)\n",
					m_pooled_order[k].first, e.second, diff0, reconv_pc, (unsigned long long)m_cur_prog_hash);
			continue;
		}
		m_pooled_order_mode_safe = false;
		if (s_logged.insert(log_key).second)
			std::fprintf(stderr, "[pooled] mode-setter/branch conflict (pc %02x -> pc %02x, prog %016llx, st1cache branch=%06x vs walk=%06x): %s; program runs via interpreter (KPROP_PF4_MODE_UNSAFE_COMPILE=1 overrides)\n",
				m_pooled_order[k].first, e.second, (unsigned long long)m_cur_prog_hash,
				after_k, mode_at_entry[tj], refuse);
		break;
	}
}

