joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
#if defined(KPROP_JIT_X64) || defined(KPROP_JIT_A64)
namespace {
using namespace asmjit;

// The pooled path's concrete assembler for this host (2026-07-07: dual-backend; the a64 twins of
// emit_thunks/emit_pooled_driver/emit_pool_bodies live below the x86 ones).
#ifdef KPROP_JIT_X64
using PooledAssembler = x86::Assembler;
#else
using PooledAssembler = a64::Assembler;
#endif

// One shared op-body pool entry: the body's label + a representative instruction descriptor and the
// device that owns it (emit_op_pooled probes st1 / reads the descriptor at emit time; the emitted code
// is DEVICE-INDEPENDENT — it operates on the pinned DEV register at runtime — so one body per op-id
// serves every program that uses that op-id).
struct PoolBody { Label label; uint64_t icd; tms57002_device *owner; };

// Records the first emit error. asmjit returns a per-call Error that this code historically ignored;
// without a handler a failed encoding SILENTLY DROPS the instruction (2026-07-07 a64 lesson: device
// offsets > imm12 range dropped the pc load, and the frame dispatched on a stale register). Attached
// to the CodeHolder in compile_frame_pooled/compile_fused; any error fails the WHOLE compile, which
// deopts that program to the interpreter — slow but never wrong.
struct PooledErrorSink : ErrorHandler {
	Error err = Error::kOk;
	void handle_error(Error e, const char *message, BaseEmitter *) override {
		if (err == Error::kOk) err = e;
		std::fprintf(stderr, "[pooled] asmjit emit error: %s (frame compile aborted -> interpreter)\n", message ? message : "?");
	}
};

// idea ③ (driver-size reduction): rel32 CALL THUNKS. Each C-ABI helper (jit_w_xm/op/post/run_rest) is
// reached once at a shared in-region thunk (`mov rax, imm64; jmp rax`) that the drivers `call` via a
// 5-byte rel32 — vs a 12-byte `mov rax, imm64; call rax` at every call site. Same behavior (the thunk
// tail-jumps, the helper returns straight to the driver), ~7 bytes saved per call site × ~2 calls/PC ×
// ~737 PCs ≈ 10KB smaller driver -> better L1I retention when fused. Thunks are shared across all 3
// fused drivers. Allocated by the caller (labels), emitted once by emit_thunks after the drivers.
struct Thunks { Label xm, op, post, rest, forced_fallback; };

#ifdef KPROP_JIT_X64
void emit_thunks(x86::Assembler &a, const Thunks &t)
{
	auto thunk = [&](Label lbl, void *fn) { a.bind(lbl); a.mov(x86::rax, Imm(uint64_t(fn))); a.jmp(x86::rax); };
	thunk(t.xm, reinterpret_cast<void *>(&jit_w_xm));
	thunk(t.op, reinterpret_cast<void *>(&jit_w_op));
	thunk(t.post, reinterpret_cast<void *>(&jit_w_post));
	thunk(t.rest, reinterpret_cast<void *>(&jit_w_run_rest));
	thunk(t.forced_fallback, reinterpret_cast<void *>(&jit_w_forced_midframe_fallback_hit));
}
#endif  // KPROP_JIT_X64

// Ensure `pool` has a body (label allocated via `a`) for every poolable op-id `order` uses on `dsp`.
// Shared across the fused drivers (called once per program) so each op-id body appears exactly once.
// (BaseEmitter: arch-independent — only allocates labels.)
void scan_pool(BaseEmitter &a, tms57002_device &dsp,
               const std::vector<std::pair<int, int>> &order, std::map<unsigned, PoolBody> &pool)
{
	for (const auto &e : order)
	{
		int cur = e.second;
		for (int s = 0; s <= 64; s++)
		{
			const unsigned op = dsp.jit_inst_op(cur);
			if (op < 4) break;
			if (tms57002::op_poolable(dsp, op) && !pool.count(op))
				pool.emplace(op, PoolBody{ a.new_label(), dsp.jit_inst_addr(cur), &dsp });
			cur = dsp.jit_inst_next(cur);
		}
	}
}

#ifdef KPROP_JIT_X64
// Emit ONE program's pooled driver (prologue..ret) into `a`, calling into the (already-scanned) shared
// `pool`. Bind the caller's entry label BEFORE calling this — the driver's first instruction is the
// prologue. Returns false on unsupported shape (caller bails). Pool bodies are emitted SEPARATELY (once).
bool emit_pooled_driver(x86::Assembler &a, tms57002_device &dsp,
                        const std::vector<std::pair<int, int>> &order, const std::map<unsigned, PoolBody> &pool,
                        const Thunks &thunks)
{
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	const int off_aacc = int(tms57002_device::jit_off_aacc());
	const int off_sti = int(tms57002_device::jit_off_sti());
	const int off_ca = int(tms57002_device::jit_off_ca());
	const int off_id = int(tms57002_device::jit_off_id());
	const int off_pc = int(tms57002_device::jit_off_pc());
	const int off_ic = int(tms57002_device::jit_off_icount());
	const int off_pend = int(tms57002_device::jit_off_pending_pre_transfer());
	const int off_rptc = int(tms57002_device::jit_off_rptc());
	const int off_rptcn = int(tms57002_device::jit_off_rptc_next());
	const u32 idle_mask = tms57002_device::jit_s_idle_mask();
	const u32 rw_mask = tms57002_device::jit_s_read_mask() | tms57002_device::jit_s_write_mask();
	const x86::Gp DEV = x86::rbx, MACC = x86::r12, MACR = x86::r13, MACW = x86::r14, AACC = x86::r15, PARAM = x86::r11;

	const int nsteps = int(order.size());
	if (nsteps == 0)
		return false;

	// [KPROP_PF4_FORCE_MIDFRAME_FALLBACK=<pc>] F3 test knob (2026-07-05): at that one PC, force the
	// mid-frame fallback path (spill -> jit_w_run_rest -> interpreter finishes the frame under
	// jit_running()'s icount/idle contract). Proves the in-frame fallback is byte-exact in the live
	// machine — it is otherwise ~never exercised (frame-level fallbacks dominate the stats).
	// KPSHIP-ENGINE: JIT mid-frame-fallback forcing knob (must stay byte-identical). Bake safe default, delete.
	static const int force_fb_pc = [] {
		const char *e = std::getenv("KPROP_PF4_FORCE_MIDFRAME_FALLBACK");
		return (e && *e) ? int(std::strtol(e, nullptr, 0)) : -1;
	}();

	// Fused slow-post trigger test: (m_pending_pre_transfer | rptc | rptc_next) are three adjacent u8s
	// (tms57002.h declares them together for exactly this), so the per-instruction test is ONE dword
	// load + mask instead of three byte loads. Adjacency is verified here at emit time; if the layout
	// ever changes the driver falls back to the three-load form (slower, never wrong).
	int off_flags_lo = off_rptc < off_rptcn ? off_rptc : off_rptcn;
	if (off_pend < off_flags_lo) off_flags_lo = off_pend;
	int off_flags_hi = off_rptc > off_rptcn ? off_rptc : off_rptcn;
	if (off_pend > off_flags_hi) off_flags_hi = off_pend;
	const bool fused_flags = (off_flags_hi - off_flags_lo == 2)
		&& off_rptc != off_rptcn && off_rptc != off_pend && off_rptcn != off_pend;

	// Does this program arm an XRAM transaction anywhere? rde/wre are the ONLY S_READ/S_WRITE setters
	// in the whole op set (verified in the generated .hxx; nothing in the core arms them either). If
	// the program has none, the per-PC pc_pre xm test is dead weight: hoist it to ONE check at frame
	// entry (armed there = a previous program's transaction still in flight across a PLOAD -> let the
	// interpreter run this frame; it xm_steps per instruction until the transaction drains).
	bool program_has_xm = false;
	for (const auto &e : order)
	{
		int cur = e.second;
		for (int s = 0; s <= 64; s++)
		{
			const unsigned op = dsp.jit_inst_op(cur);
			if (op < 4) break;
			const char *mn = dsp.jit_op_mnemonic(op);
			if (mn && (__builtin_strcmp(mn, "rde") == 0 || __builtin_strcmp(mn, "wre") == 0))
			{
				program_has_xm = true;
				break;
			}
			cur = dsp.jit_inst_next(cur);
		}
		if (program_has_xm) break;
	}

	// A label per emitted PC (branch targets reference these). Per-driver (not shared).
	std::map<int, Label> pc_label;
	for (int k = 0; k < nsteps; k++)
		pc_label.emplace(order[k].first, a.new_label());
	Label done = a.new_label(), fallback = a.new_label();
	auto is_branch_mn = [](const char *mn) { return mn && (__builtin_strcmp(mn, "bgz") == 0 || __builtin_strcmp(mn, "blz") == 0 || __builtin_strcmp(mn, "bnz") == 0 || __builtin_strcmp(mn, "bv") == 0 || __builtin_strcmp(mn, "b") == 0); };

	auto spill = [&]() {
		a.mov(x86::qword_ptr(DEV, off_macc), MACC);
		a.mov(x86::qword_ptr(DEV, off_macc_r), MACR);
		a.mov(x86::qword_ptr(DEV, off_macc_w), MACW);
		a.mov(x86::dword_ptr(DEV, off_aacc), AACC.r32());
	};
	auto reload = [&]() {
		a.mov(MACC, x86::qword_ptr(DEV, off_macc));
		a.mov(MACR, x86::qword_ptr(DEV, off_macc_r));
		a.mov(MACW, x86::qword_ptr(DEV, off_macc_w));
		a.mov(AACC.r32(), x86::dword_ptr(DEV, off_aacc));
	};
	// prologue: preserve the pinned callee-saved regs (5 pushes -> rsp 16-aligned for calls), load state.
	a.push(x86::rbx); a.push(x86::r12); a.push(x86::r13); a.push(x86::r14); a.push(x86::r15);
	a.mov(DEV, x86::rdi);
	reload();

	if (!program_has_xm)
	{
		// xm hoist: no rde/wre in this program -> nothing in-frame can arm S_READ/S_WRITE, so test it
		// ONCE here instead of per PC. Armed at entry -> the interpreter finishes this frame (fallback
		// with the re-decode sentinel); the pooled frame re-engages once the transaction drains.
		Label xm_clear = a.new_label();
		a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
		a.test(x86::ecx, Imm(rw_mask));
		a.jz(xm_clear);
		a.mov(x86::eax, Imm(-1));
		a.jmp(fallback);
		a.bind(xm_clear);
	}

