joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	// [continuation] mid-PC entry: jump to the label for the CURRENT device pc. A fresh frame enters at
	// pc==start_pc (-> order[0]); a partial-frame continuation (the previous timeslice exited at icount<=0)
	// re-enters at the mid-frame pc. The order is linear/contiguous (order[k].first = (start_pc+k)&0xff), so
	// the table index is (pc - start_pc)&0xff. run_begun_frame_pooled guarantees pc is within this frame.
	const Label entry_table = a.new_label();
	{
		const int base_pc = order.front().first;
		a.movzx(x86::eax, x86::byte_ptr(DEV, off_pc));
		if (base_pc) a.sub(x86::eax, Imm(base_pc));
		a.and_(x86::eax, Imm(0xff));
		a.lea(x86::rcx, x86::ptr(entry_table));                     // rcx = &table (runtime addr)
		a.movsxd(x86::rax, x86::dword_ptr(x86::rcx, x86::rax, 2));   // rax = signed 32-bit (label - table)
		a.add(x86::rax, x86::rcx);                                   // rax = target label addr
		a.jmp(x86::rax);
	}

	for (int k = 0; k < nsteps; k++)
	{
		const int pc_k = order[k].first, ipc_k = order[k].second;
		a.bind(pc_label[pc_k]);
		Label chain_end = a.new_label();

		// jit_pc_pre: xm_step only if S_READ|S_WRITE (C-ABI, preserves pinned regs; no macc/aacc touch).
		// Omitted entirely for programs with no rde/wre — see the entry-time xm hoist above.
		if (program_has_xm)
		{
			Label skip = a.new_label();
			a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
			a.test(x86::ecx, Imm(rw_mask));
			a.jz(skip);
			a.mov(x86::rdi, DEV);
			a.call(thunks.xm);
			a.bind(skip);
		}
		// MACC pipeline (registers): macc_read = macc_write; macc_write = macc.
		a.mov(MACR, MACW);
		a.mov(MACW, MACC);

		int cur = ipc_k, chain_ipc = dsp.jit_inst_next(cur);
		bool is_branch = false; int branch_target = -1;
		bool chain_had_deopt = false;   // any deopted op in this chain (only a deopt can set S_IDLE)
		for (int steps = 0; ; steps++)
		{
			if (steps > 64)
				return false;
			const unsigned op = dsp.jit_inst_op(cur);
			const int next = dsp.jit_inst_next(cur);
			chain_ipc = next;
			if (op >= 4 && !dsp.jit_op_mnemonic(op))
				return false;   // stale/out-of-range op -> bail; caller runs this frame via interpreter
			if (op < 4)
			{
				if (op == 1 || op == 3) { a.movzx(x86::eax, x86::byte_ptr(DEV, off_ca)); a.add(x86::eax, Imm(1)); a.mov(x86::byte_ptr(DEV, off_ca), x86::al); }
				if (op == 2 || op == 3) { a.movzx(x86::eax, x86::byte_ptr(DEV, off_id)); a.add(x86::eax, Imm(1)); a.mov(x86::byte_ptr(DEV, off_id), x86::al); }
				break;
			}
			if (is_branch_mn(dsp.jit_op_mnemonic(op))) { is_branch = true; branch_target = int(dsp.jit_inst_param(cur)); }
			auto pit = pool.find(op);
			if (pit != pool.end())
			{
				// POOL: operand in r11 (=PARAM), then call the shared body under the private convention.
				if (dsp.jit_pf4_cmem_deopt() && tms57002::op_reads_cmem(dsp, op))
				{
					// CMEM-read op under KPROP_PF4_CMEM_DEOPT: deopt to the interpreter when an
					// update is pending (head != tail) and not force-unsafe; else fast body.
					const uint64_t icd = dsp.jit_inst_addr(cur);
					Label do_fast = a.new_label(), guard_done = a.new_label();
					a.movzx(x86::eax, x86::byte_ptr(DEV, int(tms57002_device::jit_off_uc_head())));
					a.movzx(x86::ecx, x86::byte_ptr(DEV, int(tms57002_device::jit_off_uc_tail())));
					a.cmp(x86::eax, x86::ecx);
					a.je(do_fast);                                   // no pending -> fast
					a.movzx(x86::eax, x86::byte_ptr(DEV, int(tms57002_device::jit_off_pf4_force())));
					a.test(x86::eax, x86::eax);
					a.jnz(do_fast);                                  // force-unsafe baseline -> fast
					spill();
					a.mov(x86::rdi, DEV);
					a.mov(x86::esi, Imm(op));
					a.mov(x86::rdx, Imm(icd));
					a.call(thunks.op);
					reload();
					a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
					a.test(x86::ecx, Imm(idle_mask));
					a.jnz(chain_end);
					a.jmp(guard_done);
					a.bind(do_fast);
					a.mov(PARAM.r32(), Imm(u32(u8(dsp.jit_inst_param(cur)))));
					a.call(pit->second.label);
					a.bind(guard_done);
				}
				else
				{
					a.mov(PARAM.r32(), Imm(u32(u8(dsp.jit_inst_param(cur)))));
					a.call(pit->second.label);
				}
			}
			else
			{
				// DEOPT: spill pinned, run the op via the interpreter, reload. (Branches run here too —
				// they set device pc=target + S_BRANCH, which the post below applies; control is native.)
				chain_had_deopt = true;
				const uint64_t icd = dsp.jit_inst_addr(cur);
				spill();
				a.mov(x86::rdi, DEV);
				a.mov(x86::esi, Imm(op));
				a.mov(x86::rdx, Imm(icd));
				a.call(thunks.op);
				reload();
				a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));   // op set S_IDLE -> end chain
				a.test(x86::ecx, Imm(idle_mask));
				a.jnz(chain_end);
			}
			cur = next;
		}
		a.bind(chain_end);

		// post — inline fast path. The common case (jit_pc_post with no pending pre-transfer, no
		// repeat, no branch, no pc0/255 transition) is just `icount--; pc++`. Compile-time specialize:
		//  - branch PCs and pc_k in {0,255} always take the slow post (jit_w_post applies S_BRANCH / the
		//    pc0 callback / rptc). Non-branch pc_k in [1,254] never set S_BRANCH (only branch ops do; the
		//    prior post cleared it) and never cause a pc0 transition, so those guards are dropped statically.
		//  - the remaining runtime conditions (pending pre-transfer / rptc / rptc_next, e.g. a deopted rptk)
		//    are one combined byte OR -> slow. Skips m_pc_hits[pc]++ (a diagnostic histogram not in the gate
		//    fingerprint), exactly like emit_post_regcached in the unrolled frame.
		// Fast-path epilogue fusions (2026-07-07; each runs on EVERY instruction of every pooled frame):
		//  - pc is stored as the static constant pc_k+1 (pure store, not an inc RMW), which also makes the
		//    linear "pc advanced" guard vacuous on this path — it is emitted after a SLOW post only.
		//  - `dec icount` sets SF/ZF/OF, so the timeslice exit is the fused `dec; jle done`; the separate
		//    `cmp icount,0` load survives only after a slow post (jit_w_post decrements in memory).
		//  - the frame-level S_IDLE test is emitted only when the chain contains a deopted op: the `idle`
		//    op is the ONLY S_IDLE setter in the op set (verified in the generated .hxx) and it is never
		//    poolable, and jit_pc_post cannot set S_IDLE either (apply_pending_pre_transfer only writes
		//    dmem; the serial-phase arm is excluded frame-level by !serial_cycle_model).
		auto post_slow = [&]() {
			a.mov(x86::rdi, DEV);
			a.mov(x86::esi, Imm(ipc_k));
			a.mov(x86::edx, Imm(chain_ipc));
			a.call(thunks.post);
		};
		// eax = -1 is the "re-decode at the device pc" resume sentinel (same as a branch post's return).
		auto force_fb = [&]() {
			if (force_fb_pc >= 0 && pc_k == force_fb_pc)
			{
				a.call(thunks.forced_fallback);
				a.mov(x86::eax, Imm(-1));
				a.jmp(fallback);
			}
		};
		// timeslice bound (on BOTH post paths below): the interpreter's outer loop halts at icount<=0 and
		// finishes the frame on the NEXT timeslice. Match it — exit the compiled frame at icount<=0 after
		// any PC's post (device pc/state left mid-frame; the interpreter resumes it). Running the whole
		// frame regardless of the timeslice would desync the DSP from the H8 (the DSP3-long-frame
		// extra-XM-frame divergence). Never remove these exits.
		if (is_branch || pc_k == 0 || pc_k == 255)
		{
			post_slow();
			a.cmp(x86::dword_ptr(DEV, off_ic), Imm(0));
			a.jle(done);
			force_fb();
		}
		else
		{
			Label pslow = a.new_label(), pnext = a.new_label();
			if (fused_flags)
			{
				a.mov(x86::ecx, x86::dword_ptr(DEV, off_flags_lo));
				a.test(x86::ecx, Imm(0x00ffffff));   // any of the three adjacent flag bytes nonzero -> slow
				a.jnz(pslow);
			}
			else
			{
				a.movzx(x86::ecx, x86::byte_ptr(DEV, off_pend));
				a.or_(x86::cl, x86::byte_ptr(DEV, off_rptc));
				a.or_(x86::cl, x86::byte_ptr(DEV, off_rptcn));
				a.jnz(pslow);
			}
			a.mov(x86::byte_ptr(DEV, off_pc), Imm(pc_k + 1));   // FAST: pc = pc_k+1 (static; no pc0 transition)
			a.dec(x86::dword_ptr(DEV, off_ic));                  //       icount--, flags set ...
			a.jle(done);                                         //       ... fused timeslice exit
			force_fb();
			if (chain_had_deopt)
			{
				// a deopted op (e.g. `idle`) may have set S_IDLE mid-chain -> end the frame.
				a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
				a.test(x86::ecx, Imm(idle_mask));
				a.jnz(done);
			}
			a.jmp(pnext);   // pc == pc_k+1 by construction -> no linear guard on the fast path
			a.bind(pslow);
			post_slow();
			a.cmp(x86::dword_ptr(DEV, off_ic), Imm(0));
			a.jle(done);
			force_fb();
			if (chain_had_deopt)
			{
				a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
				a.test(x86::ecx, Imm(idle_mask));
				a.jnz(done);
			}
			if (k < nsteps - 1)
			{   // safety: the slow post must have advanced pc to the next emitted PC (linear); a repeat
				// (rptc) or any other divergence lands elsewhere -> fallback (eax = the post's resume ipc).
				a.movzx(x86::ecx, x86::byte_ptr(DEV, off_pc));
				a.cmp(x86::ecx, Imm(order[k + 1].first));
				a.jne(fallback);
			}
			a.bind(pnext);
			continue;   // epilogue fully emitted for the non-branch [1,254] case
		}

		if (is_branch)
		{
			// M3 native branch: the branch op + post set device pc to target (taken) or pc+1 (not taken).
			// Dispatch on the (robust) device pc: taken -> jump to the target PC's label; else fall through
			// to the next emitted PC (= pc_k+1, the not-taken path).
			auto tl = pc_label.find(branch_target);
			if (tl == pc_label.end())
				return false;   // branch target not compiled (shouldn't happen for forward branches) -> bail
			// (2026-07-07) latent-hole hardening: a deopted op EARLIER in this chain (e.g. `idle`) may
			// have set S_IDLE and skipped the branch op via the deopt chain_end — the interpreter's outer
			// loop stops there, so the frame must end BEFORE dispatching the branch. No current program
			// pairs idle with a branch in one word, but the check costs 3 instructions on branch PCs only.
			a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
			a.test(x86::ecx, Imm(idle_mask));
			a.jnz(done);
			// F2 (2026-07-05): fully guard the branch edge — it was the one unguarded control exit.
			// (a) repeat pending (rptc != 0 after the post): the interpreter re-runs the branch CHAIN
			//     rptc times (jit_pc_post returned ipc = iipc); the driver can't model that -> fallback.
			//     Catches taken AND not-taken repeats. eax = the slow post's resume ipc (branch PCs
			//     always take the slow post), which is exactly what `fallback` expects.
			a.movzx(x86::ecx, x86::byte_ptr(DEV, off_rptc));
			a.test(x86::ecx, x86::ecx);
			a.jnz(fallback);
			a.movzx(x86::ecx, x86::byte_ptr(DEV, off_pc));
			a.cmp(x86::ecx, Imm(branch_target));
			a.je(tl->second);
			if (k < nsteps - 1)
			{
				// (b) the not-taken path must have landed on pc_k+1; anything else would silently
				//     execute the wrong PC's body -> fallback (same guard every linear exit has).
				a.cmp(x86::ecx, Imm(order[k + 1].first));
				a.jne(fallback);
			}
		}
		else
		{
			// pc_k in {0,255} non-branch (always slow post): frame-level idle + linear guard
			// (uses ecx; eax = post's return preserved for the fallback).
			a.mov(x86::ecx, x86::dword_ptr(DEV, off_sti));
			a.test(x86::ecx, Imm(idle_mask));
			a.jnz(done);
			if (k < nsteps - 1)
			{   // safety: pc must have advanced to the next emitted PC (linear); else unexpected divergence.
				a.movzx(x86::ecx, x86::byte_ptr(DEV, off_pc));
				a.cmp(x86::ecx, Imm(order[k + 1].first));
				a.jne(fallback);   // eax = resume ipc at the jump
			}
		}
	}
	a.jmp(done);

