joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	// fallback: eax = resume ipc. finish the frame via the interpreter (mutates state -> spill/reload).
	a.bind(fallback);
	a.mov(x86::r10d, x86::eax);   // stash resume ipc (r10 survives spill; spill uses only DEV + pinned)
	spill();
	a.mov(x86::rdi, DEV);
	a.mov(x86::esi, x86::r10d);
	a.call(thunks.rest);
	reload();
	// fall through to done

	a.bind(done);
	spill();
	a.pop(x86::r15); a.pop(x86::r14); a.pop(x86::r13); a.pop(x86::r12); a.pop(x86::rbx);
	a.ret();

	// entry jump table (data, never executed): one 8-byte absolute label address per emitted PC, indexed by
	// (device_pc - start_pc)&0xff. Emitted after ret so it doesn't fall into the code path.
	a.bind(entry_table);
	for (int k = 0; k < nsteps; k++)
		a.embed_label_delta(pc_label[order[k].first], entry_table, 4);   // signed 32-bit (label - table), relocation-free
	return true;
}

// Emit the SHARED op-body pool (one body per op-id in `pool`), each via emit_op_pooled + `ret`. Reached
// only by `call` from the drivers. Uses each body's owner device for the emit-time probe.
void emit_pool_bodies(x86::Assembler &a, const std::map<unsigned, PoolBody> &pool)
{
	const x86::Gp DEV = x86::rbx, MACC = x86::r12, MACR = x86::r13, MACW = x86::r14, AACC = x86::r15, PARAM = x86::r11;
	const tms57002::PoolRegs pregs{ DEV, MACC, MACR, MACW, AACC, PARAM };
	for (const auto &kv : pool)
	{
		a.bind(kv.second.label);
		tms57002::emit_op_pooled(a, pregs, *kv.second.owner, kv.first, kv.second.icd);
		a.ret();
	}
}

#elif defined(KPROP_JIT_A64)
// ===== a64 twins (2026-07-07 port) ==========================================
// Same structure and guard set as the x86 driver above, translated per the port rules (explicit
// flag ops, cmp+csel, materialized constants, ldr/orr/str RMW). Convention: DEV=x19, MACC=x20,
// MACR=x21, MACW=x22, AACC=x23(w23), PARAM=w15; driver scratch w9/w10/x11 (all caller-saved);
// x16 is the thunk veneer register; x30 saved in the prologue (the driver bl's into pool bodies).

// C-ABI helper thunks, one shared in-region veneer per helper (the a64 analog of the x86 rel32
// thunks: `bl thunk` is a 4-byte instruction vs a 4-insn mov+blr at every call site).
void emit_thunks(a64::Assembler &a, const Thunks &t)
{
	auto thunk = [&](Label lbl, void *fn) { a.bind(lbl); a.mov(a64::x16, Imm(uint64_t(fn))); a.br(a64::x16); };
	thunk(t.xm, reinterpret_cast<void *>(&jit_w_xm));
	thunk(t.op, reinterpret_cast<void *>(&jit_w_op));
	thunk(t.post, reinterpret_cast<void *>(&jit_w_post));
	thunk(t.rest, reinterpret_cast<void *>(&jit_w_run_rest));
	thunk(t.forced_fallback, reinterpret_cast<void *>(&jit_w_forced_midframe_fallback_hit));
}

// Emit ONE program's pooled driver (prologue..ret) into `a` — see the x86 twin for the design
// comments (entry table, F2/F5-era guards, timeslice contract, fallback); they apply verbatim.
bool emit_pooled_driver(a64::Assembler &a, tms57002_device &dsp,
                        const std::vector<std::pair<int, int>> &order, const std::map<unsigned, PoolBody> &pool,
                        const Thunks &thunks)
{
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	const int off_aacc = int(tms57002_device::jit_off_aacc());
	const int off_sti = int(tms57002_device::jit_off_sti());
	const int off_ca = int(tms57002_device::jit_off_ca());
	const int off_id = int(tms57002_device::jit_off_id());
	const int off_pc = int(tms57002_device::jit_off_pc());
	const int off_ic = int(tms57002_device::jit_off_icount());
	const int off_pend = int(tms57002_device::jit_off_pending_pre_transfer());
	const int off_rptc = int(tms57002_device::jit_off_rptc());
	const int off_rptcn = int(tms57002_device::jit_off_rptc_next());
	const u32 idle_mask = tms57002_device::jit_s_idle_mask();
	const u32 rw_mask = tms57002_device::jit_s_read_mask() | tms57002_device::jit_s_write_mask();
	const a64::Gp DEV = a64::x19, MACC = a64::x20, MACR = a64::x21, MACW = a64::x22, AACC = a64::x23, PARAM = a64::x15;
	const a64::Gp S0 = a64::x9, S1 = a64::x10, S2 = a64::x11;   // driver scratch (caller-saved)
		const int off_uc_head = int(tms57002_device::jit_off_uc_head());     // CMEM-deopt guard (KPROP_PF4_CMEM_DEOPT)
		const int off_uc_tail = int(tms57002_device::jit_off_uc_tail());
		const int off_pf4_force = int(tms57002_device::jit_off_pf4_force());
		const bool cmem_deopt = dsp.jit_pf4_cmem_deopt();

	const int nsteps = int(order.size());
	if (nsteps == 0)
		return false;

	std::map<int, Label> pc_label;
	for (int k = 0; k < nsteps; k++)
		pc_label.emplace(order[k].first, a.new_label());
	Label done = a.new_label(), fallback = a.new_label();
	auto is_branch_mn = [](const char *mn) { return mn && (__builtin_strcmp(mn, "bgz") == 0 || __builtin_strcmp(mn, "blz") == 0 || __builtin_strcmp(mn, "bnz") == 0 || __builtin_strcmp(mn, "bv") == 0 || __builtin_strcmp(mn, "b") == 0); };

	// Offset-guarded device-field accessors. Device offsets run past 0x3a00, which exceeds the
	// scaled-imm12 range of the BYTE forms (4095) and can exceed the 32-bit forms (16380) — a raw
	// a64::ptr(DEV, off) there is an encoding error (and without the error sink it silently dropped
	// the instruction: the original port bug). x8 is the address temp, never a value carrier.
	auto lea_dev = [&](int off) {
		if (off >= 0 && off <= 4095) a.add(a64::x8, DEV, Imm(off));
		else { a.mov(a64::x8, Imm(off)); a.add(a64::x8, DEV, a64::x8); }
	};
	auto ld64 = [&](a64::Gp x, int off) {
		if (off >= 0 && off <= 32760 && !(off & 7)) a.ldr(x.x(), a64::ptr(DEV, off));
		else { lea_dev(off); a.ldr(x.x(), a64::ptr(a64::x8)); }
	};
	auto st64 = [&](a64::Gp x, int off) {
		if (off >= 0 && off <= 32760 && !(off & 7)) a.str(x.x(), a64::ptr(DEV, off));
		else { lea_dev(off); a.str(x.x(), a64::ptr(a64::x8)); }
	};
	auto ld32 = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 16380 && !(off & 3)) a.ldr(w.w(), a64::ptr(DEV, off));
		else { lea_dev(off); a.ldr(w.w(), a64::ptr(a64::x8)); }
	};
	auto st32 = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 16380 && !(off & 3)) a.str(w.w(), a64::ptr(DEV, off));
		else { lea_dev(off); a.str(w.w(), a64::ptr(a64::x8)); }
	};
	auto ldb = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 4095) a.ldrb(w.w(), a64::ptr(DEV, off));
		else { lea_dev(off); a.ldrb(w.w(), a64::ptr(a64::x8)); }
	};
	auto stb = [&](a64::Gp w, int off) {
		if (off >= 0 && off <= 4095) a.strb(w.w(), a64::ptr(DEV, off));
		else { lea_dev(off); a.strb(w.w(), a64::ptr(a64::x8)); }
	};

	auto spill = [&]() {
		st64(MACC, off_macc);
		st64(MACR, off_macc_r);
		st64(MACW, off_macc_w);
		st32(AACC, off_aacc);
	};
	auto reload = [&]() {
		ld64(MACC, off_macc);
		ld64(MACR, off_macc_r);
		ld64(MACW, off_macc_w);
		ld32(AACC, off_aacc);
	};
	// prologue: fp/lr + the pinned callee-saved regs (x30 is live across the pool-body `bl`s).
	a.stp(a64::x29, a64::x30, a64::ptr_pre(a64::sp, -64));
	a.mov(a64::x29, a64::sp);
	a.stp(a64::x19, a64::x20, a64::ptr(a64::sp, 16));
	a.stp(a64::x21, a64::x22, a64::ptr(a64::sp, 32));
	a.str(a64::x23, a64::ptr(a64::sp, 48));
	a.mov(DEV, a64::x0);
	reload();

	// [continuation] mid-PC entry: dispatch on the CURRENT device pc via the embedded delta table
	// (adr = pc-relative, relocation-free; the pooled region is far below adr's ±1MB range).
	const Label entry_table = a.new_label();
	{
		const int base_pc = order.front().first;
		ldb(S0, off_pc);
		if (base_pc) a.sub(S0.w(), S0.w(), Imm(base_pc));
		a.and_(S0.w(), S0.w(), Imm(0xff));
		{	// Defense-in-depth (F5 spirit): an out-of-frame index would read past the delta table and
			// branch wild — the C++ entry guards make that unreachable, so trap loudly (brk #1) rather
			// than jump to garbage if a guard is ever broken. (Caught the port's silent-drop bug live.)
			Label in_range = a.new_label();
			a.cmp(S0.w(), Imm(nsteps));
			a.b_lo(in_range);
			a.brk(Imm(1));
			a.bind(in_range);
		}
		a.adr(S1, entry_table);                                  // S1 = &table
		a.ldrsw(S2, a64::ptr(S1, S0, a64::lsl(2)));              // S2 = signed 32-bit (label - table)
		a.add(S1, S1, S2);
		a.br(S1);
	}

