joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	for (int k = 0; k < nsteps; k++)
	{
		const int pc_k = order[k].first, ipc_k = order[k].second;
		a.bind(pc_label[pc_k]);
		Label chain_end = a.new_label();

		// jit_pc_pre: xm_step only if S_READ|S_WRITE (C-ABI, preserves pinned regs; no macc/aacc touch).
		{
			Label skip = a.new_label();
			ld32(S0, off_sti);
			a.mov(S1.w(), Imm(rw_mask));
			a.tst(S0.w(), S1.w());
			a.b_eq(skip);
			a.mov(a64::x0, DEV);
			a.bl(thunks.xm);
			a.bind(skip);
		}
		// MACC pipeline (registers): macc_read = macc_write; macc_write = macc.
		a.mov(MACR, MACW);
		a.mov(MACW, MACC);

		int cur = ipc_k, chain_ipc = dsp.jit_inst_next(cur);
		bool is_branch = false; int branch_target = -1;
		for (int steps = 0; ; steps++)
		{
			if (steps > 64)
				return false;
			const unsigned op = dsp.jit_inst_op(cur);
			const int next = dsp.jit_inst_next(cur);
			chain_ipc = next;
			if (op >= 4 && !dsp.jit_op_mnemonic(op))
				return false;   // stale/out-of-range op -> bail; caller runs this frame via interpreter
			if (op < 4)
			{
				if (op == 1 || op == 3) { ldb(S0, off_ca); a.add(S0.w(), S0.w(), Imm(1)); stb(S0, off_ca); }
				if (op == 2 || op == 3) { ldb(S0, off_id); a.add(S0.w(), S0.w(), Imm(1)); stb(S0, off_id); }
				break;
			}
			if (is_branch_mn(dsp.jit_op_mnemonic(op))) { is_branch = true; branch_target = int(dsp.jit_inst_param(cur)); }
			auto pit = pool.find(op);
			if (pit != pool.end())
			{
				// POOL: operand in w15 (=PARAM; write the W form so x15's upper bits stay zero),
				// then call the shared body under the private convention.
				if (cmem_deopt && tms57002::op_reads_cmem(dsp, op))
				{
					// CMEM-read op under KPROP_PF4_CMEM_DEOPT: if an update is pending
					// (head != tail) and not force-unsafe, DEOPT to the interpreter (get_cmem
					// drains the queue at the correct time); else run the fast compiled body.
					const uint64_t icd = dsp.jit_inst_addr(cur);
					Label do_fast = a.new_label(), guard_done = a.new_label();
					ldb(S0, off_uc_head); ldb(S1, off_uc_tail);
					a.cmp(S0.w(), S1.w());
					a.b_eq(do_fast);                 // no pending -> fast
					ldb(S0, off_pf4_force);
					a.cbnz(S0.w(), do_fast);         // force-unsafe baseline -> fast (divergent)
					spill();
					a.mov(a64::x0, DEV);
					a.mov(a64::w1, Imm(op));
					a.mov(a64::x2, Imm(icd));
					a.bl(thunks.op);
					reload();
					ld32(S0, off_sti);               // deopted op may set S_IDLE -> end chain
					a.mov(S1.w(), Imm(idle_mask));
					a.tst(S0.w(), S1.w());
					a.b_ne(chain_end);
					a.b(guard_done);
					a.bind(do_fast);
					a.mov(PARAM.w(), Imm(u32(u8(dsp.jit_inst_param(cur)))));
					a.bl(pit->second.label);
					a.bind(guard_done);
				}
				else
				{
					a.mov(PARAM.w(), Imm(u32(u8(dsp.jit_inst_param(cur)))));
					a.bl(pit->second.label);
				}
			}
			else
			{
				// DEOPT: spill pinned, run the op via the interpreter, reload.
				const uint64_t icd = dsp.jit_inst_addr(cur);
				spill();
				a.mov(a64::x0, DEV);
				a.mov(a64::w1, Imm(op));
				a.mov(a64::x2, Imm(icd));
				a.bl(thunks.op);
				reload();
				ld32(S0, off_sti);   // op set S_IDLE -> end chain
				a.mov(S1.w(), Imm(idle_mask));
				a.tst(S0.w(), S1.w());
				a.b_ne(chain_end);
			}
			cur = next;
		}
		a.bind(chain_end);

		// post — same compile-time specialization as the x86 twin (fast `icount--; pc++` for
		// non-branch pc in [1,254] with no pending/rptc byte set).
		auto post_slow = [&]() {
			a.mov(a64::x0, DEV);
			a.mov(a64::w1, Imm(ipc_k));
			a.mov(a64::w2, Imm(chain_ipc));
			a.bl(thunks.post);
		};
		if (is_branch || pc_k == 0 || pc_k == 255)
		{
			post_slow();
		}
		else
		{
			Label pslow = a.new_label(), pdone = a.new_label();
			ldb(S0, off_pend);
			ldb(S1, off_rptc);
			a.orr(S0.w(), S0.w(), S1.w());
			ldb(S1, off_rptcn);
			a.orr(S0.w(), S0.w(), S1.w());
			a.cbnz(S0.w(), pslow);
			ld32(S0, off_ic);    // FAST: icount--
			a.sub(S0.w(), S0.w(), Imm(1));
			st32(S0, off_ic);
			ldb(S0, off_pc);     //       pc++  (pc_k in [1,254] -> no pc0 transition)
			a.add(S0.w(), S0.w(), Imm(1));
			stb(S0, off_pc);
			a.b(pdone);
			a.bind(pslow);
			post_slow();
			a.bind(pdone);
		}

		// timeslice bound: exit the compiled frame at icount<=0 (interpreter contract; see x86 twin).
		ld32(S0, off_ic);
		a.cmp(S0.w(), Imm(0));
		a.b_le(done);

		// [KPROP_PF4_FORCE_MIDFRAME_FALLBACK=<pc>] F3 test knob — force the mid-frame fallback here.
		{
			static const int force_fb_pc = [] {
				const char *e = std::getenv("KPROP_PF4_FORCE_MIDFRAME_FALLBACK");
				return (e && *e) ? int(std::strtol(e, nullptr, 0)) : -1;
			}();
			if (force_fb_pc >= 0 && pc_k == force_fb_pc)
			{
				a.bl(thunks.forced_fallback);
				a.mov(a64::w0, Imm(-1));   // "re-decode at the device pc" resume sentinel
				a.b(fallback);
			}
		}

		if (is_branch)
		{
			auto tl = pc_label.find(branch_target);
			if (tl == pc_label.end())
				return false;   // branch target not compiled -> bail
			// F2: repeat pending -> fallback (w0 = the slow post's resume ipc; branch PCs always
			// take the slow post). Then dispatch on the device pc; not-taken must land on pc_k+1.
			ldb(S0, off_rptc);
			a.cbnz(S0.w(), fallback);
			ldb(S0, off_pc);
			a.cmp(S0.w(), Imm(branch_target));
			a.b_eq(tl->second);
			if (k < nsteps - 1)
			{
				a.cmp(S0.w(), Imm(order[k + 1].first));
				a.b_ne(fallback);
			}
		}
		else
		{
			// frame-level idle (S0/S1; w0 = post's return preserved for the fallback).
			ld32(S0, off_sti);
			a.mov(S1.w(), Imm(idle_mask));
			a.tst(S0.w(), S1.w());
			a.b_ne(done);
			if (k < nsteps - 1)
			{   // safety: pc must have advanced to the next emitted PC (linear); else divergence.
				ldb(S0, off_pc);
				a.cmp(S0.w(), Imm(order[k + 1].first));
				a.b_ne(fallback);   // w0 = resume ipc at the jump
			}
		}
	}
	a.b(done);

	// fallback: w0 = resume ipc. finish the frame via the interpreter (mutates state -> spill/reload).
	a.bind(fallback);
	a.mov(S0.w(), a64::w0);   // stash resume ipc (spill touches only DEV + pinned)
	spill();
	a.mov(a64::x0, DEV);
	a.mov(a64::w1, S0.w());
	a.bl(thunks.rest);
	reload();
	// fall through to done

