joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	a.bind(done);
	spill();
	a.ldp(a64::x19, a64::x20, a64::ptr(a64::sp, 16));
	a.ldp(a64::x21, a64::x22, a64::ptr(a64::sp, 32));
	a.ldr(a64::x23, a64::ptr(a64::sp, 48));
	a.ldp(a64::x29, a64::x30, a64::ptr_post(a64::sp, 64));
	a.ret(a64::x30);

	// entry delta table (data, never executed): one signed 32-bit (label - table) per emitted PC.
	// 4-byte entries after a 4-byte-aligned ret keep the region aligned.
	a.bind(entry_table);
	for (int k = 0; k < nsteps; k++)
		a.embed_label_delta(pc_label[order[k].first], entry_table, 4);
	return true;
}

// Emit the SHARED op-body pool (one body per op-id), each via the a64 emit_op_pooled + `ret`.
// Reached only by `bl` from the drivers; bodies never touch x30.
void emit_pool_bodies(a64::Assembler &a, const std::map<unsigned, PoolBody> &pool)
{
	const tms57002::PoolRegs pregs{ a64::x19, a64::x20, a64::x21, a64::x22, a64::x23, a64::x15 };
	for (const auto &kv : pool)
	{
		a.bind(kv.second.label);
		tms57002::emit_op_pooled(a, pregs, *kv.second.owner, kv.first, kv.second.icd);
		a.ret(a64::x30);
	}
}
#endif  // KPROP_JIT_X64 / KPROP_JIT_A64
}  // namespace
#endif

Jit::FrameFn Jit::compile_frame_pooled(tms57002_device &dsp, int max_steps, int start_pc)
{
#if defined(KPROP_JIT_X64) || defined(KPROP_JIT_A64)
	using namespace asmjit;
	(void)max_steps; (void)start_pc;
	if (m_pooled_order.empty())
		return nullptr;
	if (!m_pooled_order_mode_safe)
	{
		// A branch skips a mode-setter (build_pooled_order's F5 check) -> the fall-through decode
		// variants aren't proven path-independent -> refuse; this program runs via the interpreter.
		// KPROP_PF4_MODE_UNSAFE_COMPILE=1 compiles it anyway (the pre-audit behavior — byte-identical
		// on the current corpus, where the exercised runtime path matches the baked variants, but
		// UNPROVEN for other patches). Diagnosis/perf escape hatch; the sound fix is refining the
		// check to compare only mode fields consumed downstream of the join (see the audit note).
		// KPSHIP-ENGINE: JIT unsafe-compile escape hatch (must stay byte-identical). Bake safe default, delete.
		static const bool s_mode_unsafe_ok = [] {
			const char *e = std::getenv("KPROP_PF4_MODE_UNSAFE_COMPILE");
			return e && *e && *e != '0';
		}();
		if (!s_mode_unsafe_ok)
			return nullptr;
	}
	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	PooledErrorSink esink;
	code.set_error_handler(&esink);
	PooledAssembler a(&code);

	// One driver + its own pool copy (per-program). scan_pool BEFORE the driver (labels referenced by it).
	std::map<unsigned, PoolBody> pool;
	scan_pool(a, dsp, m_pooled_order, pool);
	Thunks thunks{ a.new_label(), a.new_label(), a.new_label(), a.new_label(), a.new_label() };
	if (!emit_pooled_driver(a, dsp, m_pooled_order, pool, thunks))
		return nullptr;
	emit_pool_bodies(a, pool);
	emit_thunks(a, thunks);
	if (esink.err != Error::kOk)   // any dropped/failed encoding -> refuse the frame (interpreter runs it)
		return nullptr;

	{ static size_t last = 0; if (code.code_size() != last) { last = code.code_size(); std::fprintf(stderr, "[pooled-size] pooled frame: %zu bytes (%d steps, %zu shared bodies)\n", code.code_size(), int(m_pooled_order.size()), pool.size()); } }

	FrameFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk)
		return nullptr;
	return out;
#else
	(void)dsp; (void)max_steps; (void)start_pc;
	return nullptr;
#endif
}

bool Jit::compile_fused(tms57002_device *const devs[3], const std::vector<std::pair<int, int>> *const orders[3],
                        FrameFn out[3], std::size_t *code_size)
{
	out[0] = out[1] = out[2] = nullptr;
#if defined(KPROP_JIT_X64) || defined(KPROP_JIT_A64)
	using namespace asmjit;
	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return false;
	PooledErrorSink esink;
	code.set_error_handler(&esink);
	PooledAssembler a(&code);

	// ONE shared pool = the union of all 3 programs' poolable ops (scanned first so every driver's
	// `call pool[op]` resolves to the single shared body). Then 3 drivers, each with an entry label,
	// then the pool bodies ONCE. Fused, only the ~18KB pool needs to stay L1I-resident; the 3 small
	// drivers stream from L2 — vs 3 separate frames each carrying their own pool copy (~3x30KB).
	std::map<unsigned, PoolBody> pool;
	for (int g = 0; g < 3; g++)
	{
		if (!orders[g] || orders[g]->empty())
			return false;
		scan_pool(a, *devs[g], *orders[g], pool);
	}
	Label entry[3] = { a.new_label(), a.new_label(), a.new_label() };
	Thunks thunks{ a.new_label(), a.new_label(), a.new_label(), a.new_label(), a.new_label() };
	for (int g = 0; g < 3; g++)
	{
		a.bind(entry[g]);
		if (!emit_pooled_driver(a, *devs[g], *orders[g], pool, thunks))
			return false;
	}
	const size_t drivers_bytes = code.code_size();   // 3 drivers only (before the shared pool bodies)
	emit_pool_bodies(a, pool);
	emit_thunks(a, thunks);
	if (esink.err != Error::kOk)   // any dropped/failed encoding -> refuse (interpreter runs these)
		return false;

	// The driver/pool split is the key finding: the per-PC DRIVER code dominates (~94%), the shared
	// op-body pool is tiny (~6%) — so sharing the pool barely shrinks the fused footprint. The retention
	// lever is driver-size reduction (post register-caching), NOT pool sharing. (One-time print.)
	{ static size_t last = 0; if (code.code_size() != last) { last = code.code_size();
		std::fprintf(stderr, "[fused-size] shared region %zu B = 3 drivers %zu (%.0f%%) + shared pool %zu (%.0f%%), %zu union op-ids\n",
			code.code_size(), drivers_bytes, 100.0 * double(drivers_bytes) / double(code.code_size()),
			code.code_size() - drivers_bytes, 100.0 * double(code.code_size() - drivers_bytes) / double(code.code_size()), pool.size()); } }
	if (code_size)
		*code_size = code.code_size();

	FrameFn base = nullptr;
	if (m_rt.add(&base, &code) != kErrorOk)
		return false;
	uint8_t *b = reinterpret_cast<uint8_t *>(base);
	for (int g = 0; g < 3; g++)
		out[g] = reinterpret_cast<FrameFn>(b + code.label_offset_from_base(entry[g]));
	return true;
#else
	(void)devs; (void)orders; (void)code_size;
	return false;
#endif
}

std::array<u32, 4> Jit::run_sample_frame_pooled(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	// The pooled bodies assume render conditions (no pending cmem update, no debug forces, no serial
	// cycle model) so cmem reads are direct + C-call-free. If those don't hold, use the unconditionally
	// correct native frame. (Live/M5 must revisit mid-frame changes; static render always satisfies it.)
	if (!dsp.jit_pooled_safe())
	{
		m_pooled_fallbacks++;
		return run_sample_native(dsp, in, max_steps);
	}
	dsp.jit_begin_frame(in);
	dsp.jit_set_icount(max_steps);
	const int ms = max_steps > 0 ? max_steps : 1;
	const int start_pc = dsp.jit_pc();
	const u32 start_st1 = dsp.dbg_st1() & tms57002_device::jit_st1_cache();
	const u32 ver = dsp.jit_program_version();

	// STEADY STATE: program unchanged AND the active entry matches (st1/ms/pc) — run its compiled frame
	// directly. One int compare per frame; no hashing, no re-decode. This is the common case.
	if (ver == m_last_prog_version && m_active && m_active->fn && !m_active->failed
		&& m_active->max_steps == ms && m_active->start_pc == start_pc && m_active->start_st1 == start_st1)
	{
		m_pooled_runs++;
		m_active->fn(&dsp);
		dsp.jit_finalize_if_idle();
		return dsp.jit_end_frame();
	}

	// Finish the ALREADY-BEGUN frame via the interpreter (used for the compile frame's result AND for
	// programs whose compile failed). Mirrors the pre-M4 interpret loop; produces the bit-exact result.
	auto finish_via_interp = [&]() -> std::array<u32, 4> {
		m_frame_trace.clear();
		int guard = ms + 16;
		while (dsp.jit_running() && int(m_frame_trace.size()) < ms && guard-- > 0)
		{
			const int ipc = dsp.jit_decode_current();
			m_frame_trace.push_back(ipc);
			dsp.jit_run_chain(ipc);
		}
		dsp.jit_finalize_if_idle();
		return dsp.jit_end_frame();
	};

	// Program changed (or first frame / st1 / max_steps differ): re-hash only when the version moved,
	// then look up the compile cache by (program hash, start_st1, max_steps).
	if (ver != m_last_prog_version) { m_last_prog_version = ver; m_cur_prog_hash = dsp.jit_program_hash(); }
	const auto key = std::make_tuple(m_cur_prog_hash, start_st1, ms);
	auto it = m_pooled_cache.find(key);
	if (it != m_pooled_cache.end())
	{
		m_active = &it->second;
		if (m_active->failed)   // known un-poolable program -> interpret the begun frame (== native for it)
		{
			m_pooled_fallbacks++;
			return finish_via_interp();
		}
		// CACHE HIT: re-prime the decode cache to the layout the compiled frame's baked pointers expect
		// (build_pooled_order is deterministic: same program+st1 -> same (pc->ipc) indices + contents),
		// then run the cached frame. NO asmjit codegen — the M4 reuse win.
		build_pooled_order(dsp, start_pc, ms);
		m_pooled_runs++;
		m_active->fn(&dsp);
		dsp.jit_finalize_if_idle();
		return dsp.jit_end_frame();
	}

