joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
	// CACHE MISS: build the program order (primes the decode cache), interpret one frame for the result,
	// compile, and store the entry. M3 native branches: build_pooled_order lays every reachable PC out in
	// program order at its correct st1; compile_frame_pooled emits bgz/blz/bnz as native jcc. A compile
	// that can't handle the shape returns nullptr -> the entry is marked failed and runs via interp.
	build_pooled_order(dsp, start_pc, ms);
	const auto result = finish_via_interp();
	PooledEntry &e = m_pooled_cache[key];
	e.fn = compile_frame_pooled(dsp, ms, start_pc);
	e.order = m_pooled_order;
	e.max_steps = ms;
	e.start_pc = start_pc;
	e.start_st1 = start_st1;
	e.failed = (e.fn == nullptr);
	if (e.fn) m_pooled_compiles++;
	m_active = &e;
	return result;
}

void Jit::run_begun_frame(tms57002_device &dsp, int max_steps)
{
	// The caller already began the frame (debug_begin_sample_frame) and reads serial_output afterwards.
	// The interpreter paths here use debug_run_cycles. [Historical note, corrected 2026-07-05: this
	// comment used to claim jit_run_chain "corrupts machine state / derails the H8" in the live machine —
	// that derailment predates 71cdb19 and was the run-past-the-timeslice icount-override bug fixed
	// there, not jit_run_chain itself (jit_run_rest loops it under jit_running(), timeslice-correct).
	// This whole path (run_begun_frame) is a superseded pre-M5 milestone kept for the harness.]
	if (m_frame_failed) {   // codegen unavailable -> finish the begun frame via the device interpreter
		dsp.debug_run_cycles(max_steps);
		return;
	}
	const int ms = max_steps > 0 ? max_steps : 1;
	const int start_pc = dsp.jit_pc();
	const u32 start_st1 = dsp.dbg_st1() & tms57002_device::jit_st1_cache();
	// Live machine RELOADS DSP programs (PLOAD) and the (pc,st1)-keyed decode cache churns, so a cached
	// compiled frame can go stale (baked ipcs/ops no longer match the program). Re-decode the start PC;
	// if its chain head differs from the recorded trace, the program/cache changed -> recompile.
	const int start_ipc = dsp.jit_decode_current();
	if (!m_frame_fn || m_frame_max_steps != ms || m_frame_start_pc != start_pc || m_frame_start_st1 != start_st1
		|| m_frame_trace.empty() || m_frame_trace.front() != start_ipc) {
		m_frame_trace.clear();   // record the per-PC decode trace by running the begun frame PC-by-PC via the
		int guard = ms + 16;     // DEVICE interpreter (debug_run_cycles), NOT jit_run_chain (which derails).
		while (!dsp.jit_is_idle() && int(m_frame_trace.size()) < ms && guard-- > 0) {
			m_frame_trace.push_back(dsp.jit_decode_current());
			dsp.debug_run_cycles(1);
		}
		m_frame_fn = compile_frame(dsp, ms, start_pc);   // nullptr on a TRANSIENT failure (cache churn) -> retry
		m_frame_max_steps = ms;                          // next frame. Do NOT permanently disable: the live
		m_frame_start_pc = start_pc;                     // program stabilizes and compiles once the cache settles.
		m_frame_start_st1 = start_st1;
		return;   // the frame already ran (interpreted) while recording
	}
	dsp.jit_set_icount(max_steps);
	m_frame_fn(&dsp);   // run the compiled native frame
	dsp.jit_finalize_if_idle();
}

bool Jit::run_begun_frame_pooled(tms57002_device &dsp, int max_steps)
{
	// M5 live seam. The frame is ALREADY begun (route_dsp_serial). Return true if we ran it (the pooled
	// compiled frame, native — never jit_run_chain, which derails the live H8); return false to have the
	// CALLER run it via rt_run (the pf=2 path, whose cycle accounting the serial model depends on).
	const int ms = max_steps > 0 ? max_steps : 1;
	// stats gate hoisted to a static (2026-07-05): this function runs PER INSTRUCTION during
	// unsafe-window retries (~10M calls in a 15s note render) — a per-call getenv() environ scan
	// here is real time. NOTE: `n` is process-global (all 3 DSPs) while runs/fallbacks/compiles
	// are per-Jit — the printed line mixes scopes; read it as "calls=total, counters=one DSP's".
	// KPSHIP-TRACE: JIT pooled-frame stats to stderr. Strip.
	static const bool s_pf4_stats = std::getenv("KPROP_PF4_STATS") != nullptr;
	if (s_pf4_stats) { static long n = 0; if ((++n % 20000) == 0) std::fprintf(stderr, "[pf4] calls=%ld runs=%ld fallbacks=%ld compiles=%ld forced_midframe=%ld\n", n, m_pooled_runs, m_pooled_fallbacks, m_pooled_compiles, s_forced_midframe_fallback_hits); }

	// Render conditions not met (serial cycle model / pending cmem / debug forces) -> caller rt_runs.
	// Also skip while a PLOAD/CLOAD is in progress: the program/coefficients are mid-upload (the program
	// space is in flux), so hashing/compiling would read a transient program (and can crash). rt_run
	// handles the load frames correctly; the pooled path resumes once the program settles.
	if (!dsp.jit_pooled_safe() || dsp.jit_host_loading())
	{
		// F1 (2026-07-05): keep m_pooled_partial PENDING here — deliberately. Unsafe conditions clear
		// MID-FRAME (the H8 streams cmem updates; get_cmem drains the queue), and the pending flag makes
		// the hook retry every instruction so the frame re-engages NATIVELY the moment it is safe again.
		// Clearing the flag here instead demoted every such frame's remainder to the interpreter
		// (measured: pf4 114% -> ~101% of realtime on the 12s gate).
		m_pooled_fallbacks++;
		return false;
	}

	const int cur_pc = dsp.jit_pc();
	const u32 ver = dsp.jit_program_version();
	// NOTE: the compiled frame runs on the scheduler's CURRENT icount (the timeslice), NOT a fresh budget —
	// its per-PC posts decrement icount and it exits at icount<=0 (mid-frame), exactly like the
	// interpreter's `while(icount>0)`. Overriding icount (running the whole frame regardless of the
	// timeslice) desynced the DSP from the H8 on the long DSP3 fx frames (an extra XM frame).

	// CONTINUATION: the previous timeslice exited THIS frame partway (icount<=0). Resume the SAME compiled
	// frame at the current mid-frame pc — the fn's entry dispatch jumps to it (native, no interpreter). The
	// H8 ran between timeslices; the program must be unchanged and the pc must still lie within the active
	// frame (a PLOAD would bump ver; the pc bound catches an unexpected jump-out).
	if (m_pooled_partial)
	{
		m_pooled_partial = false;
		// F1 soundness note (2026-07-05, learned the hard way): resuming here is correct at ANY pc,
		// INCLUDING pc0, under these guards — the compiled frame is state-driven (entry dispatch on the
		// device pc; all data in device memory), F5 verifies the baked variants are valid for every
		// on-path arrival, host st1 writes only happen inside a PLOAD (= ver bump, caught here), and a
		// stale flag at a true frame boundary makes this resume equivalent to the steady-state run.
		// Do NOT "harden" pc0 by routing it to the fresh-frame path: never-idling programs cross pc0
		// MID-LOOP in whatever mode state their loop is in, and the fresh path's start_st1 key then
		// mints new cache entries and RE-PRIMES per lap (measured: pf4 collapsed to ~57% of realtime,
		// slower than the interpreter, with cache_flush/decode dominating the profile).
		if (ver == m_last_prog_version && m_active && m_active->fn && !m_active->failed
			&& m_active->max_steps == ms
			&& ((cur_pc - m_active->start_pc) & 0xff) < int(m_active->order.size()))
		{
			m_pooled_runs++;
			m_active->fn(&dsp);
			dsp.jit_finalize_if_idle();
			m_pooled_partial = !dsp.jit_is_idle();
			return true;
		}
		m_pooled_fallbacks++;   // can't resume -> the interpreter finishes this partial frame
		return false;
	}

	// FRESH FRAME: only at a program boundary (pc 0). A non-zero pc with no pending partial frame is not a
	// valid pooled entry -> the interpreter runs it.
	if (cur_pc != 0) { m_pooled_fallbacks++; return false; }
	const int start_pc = cur_pc;   // == 0
	const u32 start_st1 = dsp.dbg_st1() & tms57002_device::jit_st1_cache();

	// STEADY STATE: program unchanged since we primed AND the active entry matches -> run its compiled
	// frame directly (no hashing, no re-decode). Safe: in steady state this DSP runs only the compiled
	// frame (which does NOT decode), so cache.inst stays as the last re-prime left it. A PLOAD bumps the
	// version (below), forcing a re-prime; nothing else churns this device's decode cache mid-run.
	if (ver == m_last_prog_version && m_active && m_active->fn && !m_active->failed
		&& m_active->max_steps == ms && m_active->start_pc == start_pc && m_active->start_st1 == start_st1)
	{
		m_pooled_runs++;
		m_active->fn(&dsp);
		dsp.jit_finalize_if_idle();
		m_pooled_partial = !dsp.jit_is_idle();
		return true;
	}

	if (ver != m_last_prog_version) { m_last_prog_version = ver; m_cur_prog_hash = dsp.jit_program_hash(); }
	const auto key = std::make_tuple(m_cur_prog_hash, start_st1, ms);
	auto it = m_pooled_cache.find(key);
	if (it != m_pooled_cache.end())
	{
		m_active = &it->second;
		if (m_active->failed) { m_pooled_fallbacks++; return false; }   // caller rt_runs
		// HIT after a program/version change: RE-PRIME the decode cache (a PLOAD flushed it) so the
		// compiled frame's baked icd pointers reference the right cache.inst entries again. Deterministic +
		// decode-only + snapshot-safe; happens once per program switch, not per frame (steady state above).
		build_pooled_order(dsp, start_pc, ms);
		m_pooled_runs++;
		m_active->fn(&dsp);
		dsp.jit_finalize_if_idle();
		m_pooled_partial = !dsp.jit_is_idle();
		return true;
	}

	// MISS: build the order (decode-only, non-destructive) + compile. Do NOT run the frame here — return
	// false so the CALLER rt_runs THIS sample (byte-identical to pf=2); the compiled frame drives from the
	// next sample on. build_pooled_order snapshot-restores, so the device is untouched for the rt_run.
	build_pooled_order(dsp, start_pc, ms);
	PooledEntry &e = m_pooled_cache[key];
	e.fn = compile_frame_pooled(dsp, ms, start_pc);
	e.order = m_pooled_order;
	e.max_steps = ms;
	e.start_pc = start_pc;
	e.start_st1 = start_st1;
	e.failed = (e.fn == nullptr);
	if (e.fn) m_pooled_compiles++;
	m_active = &e;
	return false;
}

