joelanders/mame-profligacy/src/devices/cpu/tms57002/jit/tms57002_jit.cpp
// VALIDATION: fully call-free, register-resident frame for an all-nop program. The MACC pipeline
// and pc/icount live in virtual registers for the WHOLE frame; the loop has ZERO calls and ZERO
// memory traffic (state synced to memory only at entry/exit). Tests the step-function hypothesis:
// does call-free register-resident machinery beat the clang-O2 interpreter? Bails (nullptr) if any
// real op appears — it only models nops (the machinery floor), which is all this validation needs.
Jit::FrameFn Jit::compile_frame_callfree(tms57002_device &dsp, int max_steps, int start_pc)
{
	using namespace asmjit;
	CodeHolder code;
	if (code.init(m_rt.environment()) != kErrorOk)
		return nullptr;
	const int off_macc = int(tms57002_device::jit_off_macc());
	const int off_macc_r = int(tms57002_device::jit_off_macc_read());
	const int off_macc_w = int(tms57002_device::jit_off_macc_write());
	const int off_pc = int(tms57002_device::jit_off_pc());
	const int off_ic = int(tms57002_device::jit_off_icount());

#if defined(KPROP_JIT_A64)
	a64::Compiler cc(&code);
	FuncNode *fn = cc.add_func(FuncSignature::build<void, tms57002_device *>());
	if (!fn) return nullptr;
	a64::Gp dev = cc.new_gpz("dev");
	fn->set_arg(0, dev);
	a64::Gp r_macc = cc.new_gpz(), r_macc_r = cc.new_gpz(), r_macc_w = cc.new_gpz();
	a64::Gp r_pc = cc.new_gp32(), r_ic = cc.new_gp32();
	cc.ldr(r_macc, a64::ptr(dev, off_macc));
	cc.ldr(r_macc_r, a64::ptr(dev, off_macc_r));
	cc.ldr(r_macc_w, a64::ptr(dev, off_macc_w));
	cc.ldrb(r_pc, a64::ptr(dev, off_pc));
	cc.ldr(r_ic, a64::ptr(dev, off_ic));
	for (int k = 0; k < max_steps; k++) {
		if (dsp.jit_inst_op(dsp.jit_decode((start_pc + k) & 0xff)) >= 4) return nullptr;
		cc.mov(r_macc_r, r_macc_w); cc.mov(r_macc_w, r_macc);
		cc.sub(r_ic, r_ic, Imm(1)); cc.add(r_pc, r_pc, Imm(1));
	}
	cc.str(r_macc, a64::ptr(dev, off_macc));
	cc.str(r_macc_r, a64::ptr(dev, off_macc_r));
	cc.str(r_macc_w, a64::ptr(dev, off_macc_w));
	cc.strb(r_pc, a64::ptr(dev, off_pc));
	cc.str(r_ic, a64::ptr(dev, off_ic));
	cc.ret(); cc.end_func();
	if (cc.finalize() != kErrorOk) return nullptr;
	FrameFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk) return nullptr;
	return out;

#elif defined(KPROP_JIT_X64)
	x86::Compiler cc(&code);
	FuncNode *fn = cc.add_func(FuncSignature::build<void, tms57002_device *>());
	if (!fn) return nullptr;
	x86::Gp dev = cc.new_gpz("dev");
	fn->set_arg(0, dev);
	x86::Gp r_macc = cc.new_gpz(), r_macc_r = cc.new_gpz(), r_macc_w = cc.new_gpz();
	x86::Gp r_pc = cc.new_gp32(), r_ic = cc.new_gp32();
	cc.mov(r_macc, x86::qword_ptr(dev, off_macc));     // load hot state ONCE
	cc.mov(r_macc_r, x86::qword_ptr(dev, off_macc_r));
	cc.mov(r_macc_w, x86::qword_ptr(dev, off_macc_w));
	cc.movzx(r_pc, x86::byte_ptr(dev, off_pc));
	cc.mov(r_ic, x86::dword_ptr(dev, off_ic));
	for (int k = 0; k < max_steps; k++) {
		if (dsp.jit_inst_op(dsp.jit_decode((start_pc + k) & 0xff)) >= 4) return nullptr;
		cc.mov(r_macc_r, r_macc_w); cc.mov(r_macc_w, r_macc);   // MACC pipeline, registers only
		cc.sub(r_ic, 1); cc.add(r_pc, 1);                       // post hot path, registers only
	}
	cc.mov(x86::qword_ptr(dev, off_macc), r_macc);     // write hot state back ONCE
	cc.mov(x86::qword_ptr(dev, off_macc_r), r_macc_r);
	cc.mov(x86::qword_ptr(dev, off_macc_w), r_macc_w);
	cc.mov(x86::byte_ptr(dev, off_pc), r_pc.r8());
	cc.mov(x86::dword_ptr(dev, off_ic), r_ic);
	cc.ret(); cc.end_func();
	if (cc.finalize() != kErrorOk) return nullptr;
	FrameFn out = nullptr;
	if (m_rt.add(&out, &code) != kErrorOk) return nullptr;
	{ static bool once = true; if (once) { once = false; std::fprintf(stderr, "[callfree] x86-64 JIT COMPILED + RUNNING (%d nops, %zu bytes)\n", max_steps, code.code_size()); } }
	return out;

#else
	(void)dsp; (void)max_steps; (void)start_pc;
	return nullptr;
#endif
}

std::array<u32, 4> Jit::run_sample_frame_callfree(tms57002_device &dsp, const std::array<u32, 4> &in, int max_steps)
{
	if (m_callfree_failed)
		return run_sample(dsp, in, max_steps);
	dsp.jit_begin_frame(in);
	dsp.jit_set_icount(max_steps);
	const int ms = max_steps > 0 ? max_steps : 1;
	const int start_pc = dsp.jit_pc();
	if (!m_callfree_fn || m_callfree_max != ms || m_callfree_start != start_pc)
	{
		m_callfree_fn = compile_frame_callfree(dsp, ms, start_pc);
		m_callfree_max = ms;
		m_callfree_start = start_pc;
		if (!m_callfree_fn)
		{
			m_callfree_failed = true;
			int ipc = -1, guard = ms + 16;
			while (dsp.jit_running() && guard-- > 0)
			{
				if (ipc == -1)
					ipc = dsp.jit_decode_current();
				ipc = dsp.jit_run_chain(ipc);
			}
			dsp.jit_finalize_if_idle();
			return dsp.jit_end_frame();
		}
	}
	m_callfree_fn(&dsp);
	dsp.jit_finalize_if_idle();
	return dsp.jit_end_frame();
}

int Jit::asmjit_self_check()
{
	asmjit::JitRuntime rt;   // ASMJIT_API ctor — constructing it proves asmjit links.
	(void)rt;
	return int(asmjit::Environment::host().arch());
}

}  // namespace tms57002
